GET _search
{
  "query": {
    "match_all": {}
  }
}
#Cluster management
GET _cat/nodeattrs?v
GET _cat/indices?v
GET _cat/nodes?v


#POST the initial test document
POST /test/_doc/1
{
  "message": "test"
}

POST /star_wars/_doc/1
  {
    "Content-Type": "application/pdf",
    "Creation-Date": "2018-01-11T00:18:54Z",
    "Keywords": "",
    "Last-Modified": "2018-01-11T00:41:23Z",
    "Last-Save-Date": "2018-01-11T00:41:23Z",
    "X-Parsed-By": [
      "org.apache.tika.parser.DefaultParser",
      "org.apache.tika.parser.pdf.PDFParser"
    ],
    "X-TIKA:content": "\nSTAR WARS\nEPISODE V\n\nTHE EMPIRE STRIKES BACK\n\nWritten by\n\nLawrence Kasdan and Leigh Brackett\n\nFrom a story by George Lucas\n\n\n\nEXT. GALAXY - PLANET HOTH1 1\n\nA Star Destroyer moves through space, releasing Imperial \nprobe robots from its underside.\n\nOne of these probes zooms toward the planet Hoth and lands \non its ice- covered surface.  An explosion marks the point \nof impact.\n\nEXT. HOTH - METEORITE CRATER - SNOW PLAIN - DAY2 2\n\nA weird mechanical sound rises above the whining of the \nwind.  A strange probe robot, with several extended sensors, \nemerges from the smoke-shrouded crater.  The ominous \nmechanical probe floats across the snow plain and disappears \ninto the distance.\n\nEXT. PLAIN OF HOTH - DAY3 3\n\nA small figure gallops across the windswept ice slope.  The \nbundled rider is mounted on a large gray snow lizard, a \nTauntaun.  Curving plumes of snow rise from beneath the \nspeeding paws of the two-legged beast.\n\nThe rider gallops up a slope and reins his lizard to a stop.  \nPulling off his protective goggles, Luke Skywalker notices \nsomething in the sky.  He takes a pair of electrobinoculars \nfrom his utility belt and through them sees smoke rising \nfrom where the probe robot has crashed.\n\nThe wind whips at Luke\u0027s fur-lined cap and he activates a \ncomlink transmitter.  His Tauntaun shifts and moans \nnervously beneath him.\n\nLUKE\n(into comlink)\n\nEcho Three to Echo Seven.  Han, old \nbuddy, do you read me?\n\nAfter a little static a familiar voice is heard.\n\nHAN\n(over comlink)\n\nLoud and clear, kid.  What\u0027s up?\n\nLUKE\n(into comlink)\n\nWell, I finished my circle.  I \ndon\u0027t pick up any life readings.\n\n\n\nHAN\n(over comlink)\n\nThere isn\u0027t enough life on this ice \ncube to fill a space cruiser. The \nsensors are placed, I\u0027m going back.\n\nLUKE\n(into comlink)\n\nRight.  I\u0027ll see you shortly. \nThere\u0027s a meteorite that hit the \nground near here.  I want to check \nit out.  It won\u0027t take long.\n\nLuke clicks off his transmitter and reins back on his \nnervous lizard. He pats the beast on the head to calm it.\n\nLUKE (CONT’D)\nHey, steady girl.  What\u0027s the \nmatter?  You smell something?\n\nLuke takes a small device from his belt and starts to adjust \nit when suddenly a large shadow falls over him from behind.  \nHe hears a monstrous howl and turns to see an eleven-foot-\ntall shape towering over him.  It is a Wampa Ice Creature, \nlunging at him ferociously.\n\nLUKE (CONT’D)\nAaargh!\n\nLuke grabs for his pistol, but is hit flat in the face by a \nhuge white claw.  He falls unconscious into the snow and in \na moment the terrified screams of the Tauntaun are cut short \nby the horrible snap of a neck being broken.\n\nThe Wampa Ice Creature grabs Luke by one ankle and drags him \naway across the frozen plain.\n\nEXT. HOTH - REBEL BASE ENTRANCE - DAY4 4\n\nA stalwart figure rides his Tauntaun up to the entrance of \nan enormous ice cave.\n\nINT. HOTH - REBEL BASE - MAIN HANGAR DECK5 5\n\nRebel troopers rush about unloading supplies and otherwise \nsecuring their new base.  The rider, Han Solo, swings off \nhis lizard and pulls off his goggles.\n\nHe walks into the main hangar deck toward the Millennium \nFalcon, which is parked among several fighters.  Mechanics, \nR2 units, and various other droids hurry about.  Han stops \nat the Millennium Falcon where his Wookiee copilot, \nChewbacca, is welding on a central lifter.  \n\n2.\n\n\n\nChewie stops his work and lifts his face shield, growling an \nirritated greeting to his boss.\n\nHAN\nChewie!\n\nThe Wookiee grumbles a reply.\n\nHAN (CONT’D)\nAll right, don\u0027t lose your temper. \nI\u0027ll come right back and give you a \nhand.\n\nChewbacca puts his mask back on and returns to his welding \nas Han leaves.\n\nINT. HOTH - REBEL BASE - COMMAND CENTER6 6\n\nA makeshift command center has been set up in a blasted area \nof thick ice.  The low-ceilinged room is a beehive of \nactivity. Controllers, troops, and droids move about setting \nup electronic equipment and monitoring radar signals.\n\nGeneral Rieekan straightens up from a console at Han\u0027s \napproach.\n\nRIEEKAN\nSolo?\n\nHAN\nNo sign of life out there, General. \nThe sensors are in place.  You\u0027ll \nknow if anything comes around.\n\nRIEEKAN\nCommander Skywalker reported in \nyet?\n\nHAN\nNo.  He\u0027s checking out a meteorite \nthat hit near him.\n\nRIEEKAN\n(indicates radar screen)\n\nWith all the meteor activity in \nthis system, it\u0027s going to be \ndifficult to spot approaching \nships.\n\nTaking a deep breath, Han blurts out what is on his mind.\n\nHAN\nGeneral, I\u0027ve got to leave.  I \ncan\u0027t stay anymore.\n\n3.\n\n\n\nPrincess Leia, standing at a console nearby, is dressed in a \nshort white combat jacket and pants.  Her hair is braided \nacross her head in a Nordic fashion.  She overhears their  \nconversation and seems somewhat distressed.\n\nRIEEKAN\nI\u0027m sorry to hear that.\n\nHAN\nWell, there\u0027s a price on my head. \nIf I don\u0027t pay off Jabba the Hut, \nI\u0027m a dead man.\n\nRIEEKAN\nA death mark\u0027s not an easy thing to \nlive with.  You\u0027re a good fighter, \nSolo.  I hate to lose you.\n\nHAN\nThank you, General.\n\nHe turns to Leia as Rieekan moves away.\n\nHAN (CONT’D)\n(with feeling)\n\nWell, Your Highness, I guess this \nis it.\n\nLEIA\nThat\u0027s right.\n\nLeia is angry.  Han sees she has no warmth to offer him.  He \nshakes his head and adopts a sarcastic tone.\n\nHAN\n(cooly)\n\nWell, don\u0027t get all mushy on me. So \nlong, Princess.\n\nHan walks away into the quiet corridor adjoining the command \ncenter. Leia stews a moment, then hurries after him.\n\nINT. HOTH - REBEL BASE - ICE CORRIDOR7 7\n\nLEIA\nHan!\n\nHan stops in the corridor and turns to face Leia.\n\nHAN\nYes, Your Highnessness?\n\nLEIA\nI thought you decided to stay.\n\n4.\n\n\n\nHAN\nWell, the bounty hunter we ran into \non Ord Mantell changed my mind.\n\nLEIA\nHan, we need you!\n\nHAN\nWe?\n\nLEIA\nYes.\n\nHAN\nOh, what about you need?\n\nLEIA\n(mystified)\n\nI need?  I don\u0027t know what you\u0027re \ntalking about.\n\nHAN\n(shakes his head, fed up)\n\nYou probably don\u0027t.\n\nLEIA\nAnd what precisely am I supposed to \nknow?\n\nHAN\nCome on!  You want me to stay \nbecause of the way you feel about \nme.\n\nLEIA\nYes.  You\u0027re a great help to us. \nYou\u0027re a natural leader...\n\nHAN\nNo!  That\u0027s not it.  Come on. Aahhh \n- uh huh!  Come on.\n\nLeia stares at him, understanding, then laughs.\n\nLEIA\nYou\u0027re imagining things.\n\nHAN\nAm I?  Then why are you following \nme?  Afraid I was going to leave \nwithout giving you a goodbye kiss?\n\nLEIA\nI\u0027d just as soon kiss a Wookiee.\n\n5.\n\n\n\nHAN\nI can arrange that.  You could use \na good kiss!\n\nAngrily, Han strides down the corridor as Leia stares after \nhim.\n\nINT. HOTH - REBEL BASE - ANOTHER ICE CORRIDOR8 8\n\nA familiar stream of beeps and whistles herald the approach \nof Artoo- Detoo and See-Threepio, who appear around a corner \nand move along an ice wall toward the main hangar.\n\nTHREEPIO\nDon\u0027t try to blame me.  I didn\u0027t \nask you to turn on the thermal \nheater.  I merely commented that it \nwas freezing in the princess\u0027 \nchamber.  But it\u0027s supposed to be \nfreezing.  How are we going to dry \nout all her clothes?  I really \ndon\u0027t know.\n\nArtoo beeps a stream of protesting whistles.\n\nTHREEPIO (CONT’D)\nOh, switch off.\n\nINT. HOTH - REBEL BASE - MAIN HANGAR DECK9 9\n\nThe two robots stop at Han Solo\u0027s space freighter.  Han and \nChewie are struggling with their central lifters.\n\nHAN\n(to Chewie)\n\nWhy do you take this apart now? I\u0027m \ntrying to get us out of here and \nyou pull both of these.\n\nChewie grumbles in irritation.\n\nTHREEPIO\nExcuse me, sir.\n\nHAN\n(to Chewie)\n\nPut them back together right now.\n\nTHREEPIO\nMight I have a word with you, \nplease?\n\nHAN\nWhat do you want?\n\n6.\n\n\n\nTHREEPIO\nWell, it\u0027s Princess Leia, sir. \nShe\u0027s been trying to get you on the \ncommunicator.\n\nHAN\nI turned it off.  I don\u0027t want to \ntalk to her.\n\nTHREEPIO\nOh.  Well, Princess Leia is \nwondering about Master Luke.  He \nhasn\u0027t come back yet.  She doesn\u0027t \nknow where he is.\n\nHAN\nI don\u0027t know where he is.\n\nTHREEPIO\nNobody knows where he is.\n\nHAN\nWhat do you mean, \"nobody knows\"?\n\nHan glances at the fading light at the entrance of the ice \ncave as night slowly begins to fall on the planet.\n\nTHREEPIO\nWell, uh, you see...\n\nHan jumps down off the lift, as Threepio follows him.\n\nHAN\nDeck Officer.  Deck Officer!\n\nTHREEPIO\nExcuse me, sir.  Might I inqu...\n\nHan abruptly puts his hand over Threepio\u0027s mouth as the deck \nofficer approaches.\n\nDECK OFFICER\nYes, sir?\n\nHAN\nDo you know where Commander \nSkywalker is?\n\nDECK OFFICER\nI haven\u0027t seen him.  It\u0027s possible \nhe came in through the south \nentrance.\n\n7.\n\n\n\nHAN\nIt\u0027s possible?  Why don\u0027t you go \nfind out?  It\u0027s getting dark out \nthere.\n\nDECK OFFICER\nYes, sir.\n\nThe deck officer leaves hurriedly, as Han takes his hand off \nThreepio\u0027s mouth.\n\nTHREEPIO\nExcuse me, sir.  Might I inquire \nwhat\u0027s going on?\n\nHAN\nWhy not?\n\nTHREEPIO\nImpossible man.  Come along, Artoo, \nlet\u0027s find Princess Leia.  Between \nourselves, I think Master Luke is \nin considerable danger.\n\nINT. HOTH - REBEL BASE - MAIN ICE TUNNEL10 10\n\nThe deck officer and his assistant hurry toward Han as he \nenters the tunnel.\n\nDECK OFFICER\nSir, Commander Skywalker hasn\u0027t \ncome in through the south entrance. \nHe might have forgotten to check \nin.\n\nHAN\nNot likely.  Are the speeders \nready?\n\nDECK OFFICER\nNot yet.  We\u0027re having some trouble \nadapting them to the cold.\n\nHAN\nThen we\u0027ll have to go out on \nTauntauns.\n\nDECK OFFICER\nSir, the temperature\u0027s dropping too \nrapidly.\n\nHAN\nThat\u0027s right.  And my friends out \nin it.\n\n8.\n\n\n\nASSISTANT OFFICER\nI\u0027ll cover sector twelve.  Have com-\ncontrol set screen alpha.\n\nHan pushes through the troops and mounts a Tauntaun.\n\nDECK OFFICER\nYour Tauntaun\u0027ll freeze before you \nreach the first marker.\n\nHAN\nThen I\u0027ll see you in hell!\n\nHan maneuvers his mount out of the cave and races into the \ndark bitter night.\n\nEXT. HOTH - ICE GORGE - DUSK11 11\n\nThe jagged face of a huge ice wall sits gloomily in the dim \ntwilight of a Hoth day.  Luke hangs upside down, ankles \nfrozen into icy stalactites, his extended arms within a foot \nof the snow floor.  One side of his face is covered in a \ndried mask of frozen blood.  He opens his eyes as a chilling \nmoan of the hideous ice creature echoes off the gorge walls.  \nLuke pulls himself up, grabs hold of his ankles, and \nfutilely tries to unfasten the throngs.\n\nExhausted, he drops back into his hanging position.  As he \nhangs there, he spies his lightsaber lying near a pile of \nhis discarded gear, about three feet out of reach.\n\nHe focuses on the saber and, as his hand strains toward the \nweapon, he squeezes his eyes tight in concentration.\n\nJust as the ice creature looms over Luke, the lightsaber \njumps into Luke\u0027s hand.\n\nThe young warrior instantly ignites his sword, swinging up, \nand cuts himself loose from the ice.  He flops to the snow \nin a heap.  The startled creature moves back, his giant \nyellow eyes blinking.  Luke scrambles to his feet.  He \nswings his lightsaber and the beast screams in pain.\n\nEXT. HOTH - ENTRANCE TO ICE GORGE - DUSK12 12\n\nLuke staggers out of the gorge into the dark and snowy \ntwilight.  Weak and exhausted, he stumbles down a snow bank.\n\nEXT. HOTH - SNOW PLAIN - DUSK13 13\n\nA small, lone figure riding a Tauntaun races through the \nhostile vastness of snow and cold.  As it runs, the \nTauntaun\u0027s legs kick up large clouds of snow and ice into \nthe snowy air.\n\n9.\n\n\n\nEXT. HOTH - OUTSIDE ICE        HANGAR - DUSK14 14\n\nArtoo stands in the falling snow, beeping worriedly.  \nThreepio moves stiffly over to him.\n\nTHREEPIO\nYou must come along now, Artoo. \nThere\u0027s really nothing more we can \ndo.  And my joints are freezing up.\n\nArtoo beeps, long and low.\n\nTHREEPIO (CONT’D)\nDon\u0027t say thing like that!  Of \ncourse we\u0027ll see Master Luke again. \nHe\u0027ll be quite all right, you\u0027ll \nsee.\n\n(to himself)\nStupid little short-circuit.  He\u0027ll \nbe quite all right.\n\nThreepio turns to go back inside the main hangar as Artoo \nmournfully keeps his vigil.\n\nEXT. HOTH - SNOW DRIFT - DUSK15 15\n\nThe wind is blowing quite strong now.  Luke struggles to \nstay upright, but a blast of freezing snow knocks him over.  \nHe struggles to get up, but he can\u0027t.  The young warrior \nfrom Tatooine drags himself a couple of feet and then \ncollapses.\n\nINT. REBEL BASE - MAIN HANGAR DECK - ENTRANCE - NIGHT16 16\n\nPrincess Leia stands inside the dark entrance to the Rebel \nbase, waiting for a sign of the two Rebel heroes.  She \nshivers in the cold wind as, nearby, Chewie sits with his \nhead in his hands.  In the background, Artoo and Threepio \nmove through the doors.\n\nA Rebel lieutenant moves to Major Derlin, an officer keeping \nwatch with the princess.\n\nLIEUTENANT\nSir, all the patrols are in. \nThere\u0027s still no contact from \nSkywalker or Solo.\n\nTHREEPIO\nMistress Leia, Artoo says he\u0027s been \nquite unable to pick up any \nsignals, although he does admit \nthat his own range is far too weak \nto abandon all hope.\n\n10.\n\n\n\nLeia nods an acknowledgment, but she is lost in thought.\n\nDERLIN\nYour Highness, there\u0027s nothing more \nwe can do tonight.  The shield \ndoors must be closed.\n\nHe turns to the lieutenant.\n\nDERLIN (CONT’D)\nClose the doors.\n\nLIEUTENANT\nYes, sir.\n\nThe lieutenant walks away.  Chewie lets out a long, mournful \nhowl, somewhat like a coyote.  At the same moment, Artoo \nbegins a complex series of efficient beeps.\n\nTHREEPIO\nArtoo says the chances of survival \nare seven hundred seventy-five... \nto one.\n\nLeia stands praying to herself as the huge metal doors slam \nacross the entrance of the ice cave.  The loud booms echo \nthroughout the huge cavern.  Chewie lets out another \nsuffering howl.\n\nTHREEPIO (CONT’D)\nActually, Artoo has been known to \nmake mistakes... from time to time. \nOh, dear, oh, dear.  Don\u0027t worry \nabout Master Luke.  I\u0027m sure he\u0027ll \nbe all right.  He\u0027s quite clever, \nyou know... for a human being.\n\nEXT. HOTH - SNOW DRIFT - DUSK17 17\n\nLuke lies face down in the snow, nearly unconscious.  Slowly \nhe looks up and sees Ben Kenobi, barely visible through the \nblowing snow.  It is hard to tell if Kenobi is real or a \nhallucination.\n\nBEN\nLuke... Luke.\n\nLUKE\n(weakly)\n\nBen?\n\nBEN\nYou will go to the Dagobah system.\n\n11.\n\n\n\nLUKE\nDagobah system?\n\nBEN\nThere you will learn from Yoda, the \nJedi Master who instructed me.\n\nThe image of Ben fades, revealing a lone Tauntaun rider \napproaching from the windswept horizon.\n\nLUKE\n(groaning faintly)\n\nBen... Ben.\n\nLuke drops into unconsciousness.\n\nHan pulls up and leaps off his mount.  He hurries to his \nsnow-covered friend, cradling him in his arms.  Han\u0027s \nTauntaun lets out a low, pitiful bellow.  But Han\u0027s concern \nis with Luke, and he shakes him urgently.\n\nHAN\nLuke!  Luke!  Don\u0027t do this, Luke. \nCome on, give me a sign here.\n\nLuke doesn\u0027t respond.  Han begins frantically rubbing and \nslapping Luke\u0027s unconscious face.  As he starts to lift the \nyouth, Han hears a rasping sound behind him.  He turns, just \nin time to see his Tauntaun stagger and then fall over into \nthe snow.\n\nHan carries Luke to the moaning beast.  Then, with a final \ngroan, the Tauntaun expires.\n\nHAN (CONT’D)\nNot much time.\n\nHe pushes Luke\u0027s inert form against the belly of the dead \nbeast.\n\nLUKE\n(moaning)\n\nBen... Ben...\n\nHAN\nHang on, kid.\n\nLUKE\nDagobah system...\n\nHan ignites Luke\u0027s saber and cuts the beast from head to \ntoe.  He quickly tosses it\u0027s steaming innards into the snow, \nthen lifts Luke\u0027s inert form and stuffs him inside the \ncarcass.\n\n12.\n\n\n\nHAN\n(reeling from the odor)\n\nWhew...\n\nLUKE\nDagobah...\n\nHAN\nThis may smell bad, kid...\n\nLUKE\n(moaning)\n\nYoda...\n\nHAN\n...but it will keep you warm... til \nI get the shelter built.\n\n(struggling to get Luke \ninside the carcass)\n\nOoh... I thought they smelled bad \non the outside!\n\nThe wind has picked up considerably, making it difficult to \nmove.  Han removes a pack from the dead creature\u0027s back, \ntaking out a shelter container.  He begins to set up what \ncan only be a pitiful protection against a bitter Hoth \nnight.\n\nEXT. HOTH - SNOWDRIFT - DAWN18 18\n\nFour snub-nosed armored snowspeeders race across the white \nlandscape.\n\nINT. SNOWSPEEDER COCKPIT19 19\n\nThere is only one pilot, Zev, in the enclosed two-man craft.  \nHe concentrates on the scopes which ring his cockpit.  He \nhears a low beep from one of his monitors.\n\nZEV\n(into transmitter)\n\nEcho Base... I\u0027ve got something!  \nNot much, but it could be a life \nform.\n\nEXT. HOTH - SNOWDRIFT20 20\n\nThe small craft banks and makes a slow arc, then races off \nin a new direction.\n\nINT. SNOWSPEEDER - COCKPIT21 21\n\nThe pilot switches over to a new transmitter.\n\n13.\n\n\n\nZEV\n(into transmitter)\n\nThis is Rogue Two.  this is Rogue \nTwo.  Captain Solo, so you copy? \nCommander Skywalker, do you copy? \nThis is Rogue Two.\n\nThere is a sharp crackle of static, then a faint voice.\n\nHAN\n(filtered over Zev\u0027s \nreceiver)\n\nGood morning.  Nice of you guys to \ndrop by.\n\nZEV\n(switching transmitters)\n\nEcho Base... this is Rogue Two.  I \nfound them.  Repeat, I found them.\n\nEXT. HOTH - SNOWDRIFT - DAY22 22\n\nThe small shelter Han set up is covered with snow on the \nwindward side. A makeshift antenna rests gingerly on top the \nsnowdrift.  Han spots Zev\u0027s snowspeeder approaching in the \ndistance, and begins waving his arms frantically at the tiny \ncraft.\n\nINT. REBEL BASE - MEDICAL CENTER23 23\n\nStrange robot surgeons adjust a mass of electronic \nequipment.  A switch is thrown and a sudden blinding flash \nobscures Luke in a bacta tank filled with a thick, \ngelatinous slime.  He begins to thrash about, raving in \ndelirium.\n\nINT. REBEL BASE - MEDICAL CENTER - RECOVERY ROOM24 24\n\nLuke sits up in a recovery-room bed, weak but smiling.  His \nface shows terrible wounds from the Wampa\u0027s attack.  \nThreepio and Artoo enter the room.\n\nTHREEPIO\nMaster Luke, sir, it\u0027s so good to \nsee you fully functional again.\n\nArtoo beeps his good wishes.\n\nTHREEPIO (CONT’D)\nArtoo expresses his relief, also.\n\nHan and Chewie make their entrance.  The Wookiee growls a \ngreeting.\n\n14.\n\n\n\nHAN\nHow are you feeling, kid?  You \ndon\u0027t look so bad to me.  In fact, \nyou look strong enough to pull the \nears off a Gundark.\n\nLUKE\nThanks to you.\n\nHAN\nThat\u0027s two you owe me, junior.\n\nHan turns as Leia enters the room.  He looks at her with a \nbig, devilish grin.\n\nHAN (CONT’D)\nWell your Worship, looks like you \nmanaged to keep me around for a \nlittle while longer.\n\nLEIA\n(haughtily)\n\nI had nothing to do with it.  \nGeneral Rieekan thinks it\u0027s \ndangerous for any ships to leave \nthe system until we\u0027ve activated \nthe energy shield.\n\nHAN\nThat\u0027s a good story.  I think you \njust can\u0027t bear to let a gorgeous \nguy like me out of your sight.\n\nLEIA\nI don\u0027t know where you get your \ndelusions, laser brain.\n\nChewie is amused; he laughs in his manner.  Han, enjoying \nhimself, regards Chewie good-humoredly.\n\nHAN\nLaugh it up, fuzzball.  But you \ndidn\u0027t see us alone in the south \npassage.\n\nLuke sparks to this; he looks at Leia.\n\nHAN (CONT’D)\nShe expressed her true feelings for \nme.\n\nLeia is flushed, eyes darting between Luke and Han.\n\n15.\n\n\n\nLEIA\nMy...!  Why, you stuck up,... half- \nwitted... scruffy-looking ...nerf- \nherder!\n\nHAN\nWho\u0027s scruffy-looking?\n\n(to Luke)\nI must have hit pretty close to the \nmark to get her all riled up like \nthat, huh, kid?\n\nLeia looks vulnerable for a moment, then the mask falls \nagain, and she focuses on Luke.\n\nLEIA\nWhy, I guess you don\u0027t know \neverything about women yet?\n\nWith that she leans over and kisses Luke on the lips.  Then \nshe turns on her heel and walks out, leaving everyone in the \nroom slightly dumbstruck.  With some smugness, Luke puts his \nhands behind his head and grins.\n\nSuddenly, in the distance, the muffled sound of an alarm is \nheard.\n\nANNOUNCER\n(over loudspeaker)\n\nHeadquarters personnel, report to \ncommand center.\n\nThe voice repeats the order and Han, Chewie, Artoo, and \nThreepio hurry out of the room, bidding farewell to Luke.\n\nHAN\nTake it easy.\n\nTHREEPIO\nExcuse us, please.\n\nINT. HOTH - REBEL BASE - COMMAND CENTER25 25\n\nRieekan looks up grimly from a console screen.  He calls \nover to Leia and Han.\n\nRIEEKAN\nPrincess... we have a visitor.\n\nThe group hurries over to Rieekan.\n\n16.\n\n\n\nRIEEKAN (CONT’D)\nWe\u0027ve picked up something outside \nthe base in zone twelve, moving \neast.\n\nSENIOR CONTROLLER\nIt\u0027s metal.\n\nLEIA\nThen it couldn\u0027t be one of those \ncreatures that attacked Luke.\n\nHAN\nIt could be a speeder, one of ours.\n\nSENIOR CONTROLLER\nNo.  Wait - there\u0027s something very \nweak coming through.\n\nThreepio steps up to the control panel and listens intently \nto the strange signal.\n\nTHREEPIO\nSir, I am fluent in six million \nforms of communication.  This \nsignal is not used by the Alliance.  \nIt could be an Imperial code.\n\nThe transmission ends in static.\n\nHAN\nIt isn\u0027t friendly, whatever it is. \nCome on, Chewie, let\u0027s check it \nout.\n\nRIEEKAN\nSend Rogues Ten and Eleven to \nstation three-eight.\n\nEXT. HOTH - SNOW PLAIN - DAY26 26\n\nThe dark probe robot moves past the smoldering ruins of \nstation three- eight and down a ridge toward the Rebel base.  \nIt raises a large antenna from the top of its head and \nbegins to send out a piercing signal.\n\nThe probe droid has spotted Chewbacca who, not thirty feet \naway, has popped his head over a snow bank.  Instantly, the \nprobe robot swings around, its deadly ray ready to fire.  \nBut before it can get a shot off, it is hit from behind by a \nlaser bolt, and explodes in a million pieces.\n\nHan Solo replaces his blaster in its holster and peers \nintently at the smoldering remains of the Imperial probe.\n\n17.\n\n\n\nINT. HOTH - REBEL BASE - COMMAND CENTER27 27\n\nLeia and Rieekan listen to Han on the comlink.\n\nHAN\n(over comlink)\n\nAfraid there\u0027s not much left.\n\nLEIA\n(into comlink)\n\nWhat was it?\n\nHAN\n(over comlink)\n\nDroid of some kind.  I didn\u0027t hit \nit that hard.  It must have had a \nself-destruct.\n\nLEIA\n(into comlink)\n\nAn Imperial probe droid.\n\nHAN\n(over comlink)\n\nIt\u0027s a good bet the Empire knows \nwe\u0027re here.\n\nRIEEKAN\nWe\u0027d better start the evacuation.\n\nEXT. SPACE - IMPERIAL FLEET28 28\n\nDarth Vader\u0027s Star Destroyer, larger and more awesome than \nthe five Imperial Star Destroyers that surround it, sits in \nthe vastness of space.  The six huge ships are surrounded by \na convoy of smaller spacecraft.  TIE fighters dart to and \nfro.\n\nINT. DARTH VADER\u0027S STAR DESTROYER - BRIDGE - MAIN CONTROL 29 29\nDECK\n\nControllers working the vast complex of electronic controls \nhear ominous approaching footsteps and look up from their \ncontrols.  The squat, evil-looking Admiral Ozzel and the \nyoung, powerfully built General Veers, who have been \nconferring near the front, also feel the approaching \npresence and turn toward it.  Darth Vader, Lord of the Sith, \nenters like a chill wind.  As Vader moves across the wide \nbridge, Captain Piett hurries up to Ozzel.\n\nPIETT\nAdmiral.\n\n18.\n\n\n\nOZZEL\nYes, Captain\n\nPIETT\nI think we\u0027ve got something, sir. \nThe report is only a fragment from \na probe droid in the Hoth system, \nbut it\u0027s the best lead we\u0027ve had.\n\nOZZEL\n(irritated)\n\nWe have thousands of probe droids \nsearching the galaxy.  I want \nproof, not leads!\n\nPIETT\nThe visuals indicate life readings.\n\nOZZEL\nIt could mean anything.  If we \nfollowed every lead...\n\nPIETT\nBut, sir, the Hoth system is \nsupposed to be devoid of human \nforms.\n\nVader moves to a large screen showing an image of the Rebel \nsnow base. Rebel speeders can be seen approaching the base \nin the distance.\n\nVADER\nYou found something?\n\nPIETT\nYes, my lord.\n\nVADER\n(studying the image on \nthe console screen)\n\nThat\u0027s it.  The Rebels are there.\n\nOZZEL\nMy lord, there are so many \nuncharted settlements.  It could be \nsmugglers, it could be...\n\nVADER\nThat is the system.  And I\u0027m sure \nSkywalker is with them.  Set your \ncourse for the Hoth system.  \nGeneral Veers, prepare you men.\n\n19.\n\n\n\nINT. HOTH - REBEL BASE - TRANSPORT BAY30 30\n\nA captain issues instructions to two of his men at the \nentrance to the main transport bay.  Several Rebel \ntransports behind them are being loaded by men carrying \nheavy boxes and moving quickly, but not in panic.\n\nREBEL CAPTAIN\nGroups seven and ten will stay \nbehind to fly the speeders.  As \nsoon as each transport is loaded, \nevacuation control will give \nclearance for immediate launch.\n\nREBEL FIGHTER\nRight, sir.\n\nINT. HOTH - REBEL BASE - MAIN HANGAR DECK31 31\n\nAlarms sound.  Troops, ground crews, and droids rush to \ntheir alert stations.  Armored snowspeeders are lined up in \nattack formation near the main entrance.\n\nIn the midst of all this activity, Han does some frantic \nwelding on the lifters of the Millennium Falcon.\n\nHan finishes his work and hops down to the hangar floor.  He \npulls out his comlink, all the while eyeing problematic \nlifters.\n\nHAN\n(into comlink, to Chewie)\n\nOkay, that\u0027s it.  Try it... Off! \nTurn it off!  Turn it off!  Off!\n\nSmoke rises from a minor explosion on the lifter.  \nExasperated, Han surveys the new damage.\n\nINT. REBEL BASE - MEDICAL CENTER32 32\n\nLuke dresses in readiness for the evacuation as his \nattending medical droid stands by.\n\nMEDICAL DROID\nSir, it will take quite a while to \nevacuate the T-forty- sevens.\n\nLUKE\nWell, forget the heavy equipment. \nThere\u0027s plenty of time to get the \nsmaller modules on the transports.\n\nMEDICAL DROID\nTake care, sir.\n\n20.\n\n\n\nLUKE\nThanks.\n\nINT. REBEL BASE - MAIN HANGAR DECK33 33\n\nPilots, gunners, and R2 units scurry about.  Luke, pulling \non his heavy-weather jacket, is headed toward a row of \narmored speeders.  He stops at the rear of the Millennium \nFalcon, where Han and Chewie are trying to repair the right \nlifter with even more haste than before.\n\nLUKE\nChewie, take care of yourself, \nokay?\n\nAs Luke pats Chewie on the arm, Chewie puts his arms around \nLuke and gives him a tight hug.  Han is discussing the \nlifter with a repair droid when he sees Luke.\n\nHAN\nHi, kid.\n\n(to droid)\nThere\u0027s got to be a reason for it.  \nCheck it at the other end. Wait a \nsecond.\n\n(to Luke)\nYou all right?\n\nLUKE\nYeah.\n\nHAN\nBe careful.\n\nLUKE\nYou, too.\n\nLuke smiles, then waves at his friend and walks on.  After a \nfew steps, he stops and looks back.  Han glances up and the \ntwo exchange a silent communication, each wishing the other \nsafety, happiness - many things, all difficult to verbalize.\n\nINT. REBEL BASE - CONTROL ROOM.34 34\n\nAlarms sound throughout the hidden Rebel base.  In the \ncontrol room, a controller urgently gestures for General \nRieekan to check a computer scan.\n\nCONTROLLER\nGeneral, there\u0027s a fleet of Star \nDestroyers coming out of hyperspace \nin sector four.\n\n21.\n\n\n\nRIEEKAN\nReroute all power to the energy \nshield.  We\u0027ve got to hold them \ntill all transports are away.  \nPrepare for ground assault.\n\nRieekan exits hurriedly.\n\nINT. VADER\u0027S STAR DESTROYER - VADER\u0027S CHAMBER - MEDITATION 35 35\nCUBICLE\n\nThe dark cubicle is illuminated by a single shaft of light \nwhich falls on the brooding Dark Lord as he sits on a raised \nmeditation cube. General Veers enters the room and \napproaches the silent, unmoving Vader.  Although seemingly \nvery sure of himself, Veers is still not bold enough to \ninterrupt the meditating lord.  The younger general stands \nquietly at attention until the evil presence speaks.\n\nVADER\nWhat is it, General?\n\nVEERS\nMy lord, the fleet has moves out of \nlight-speed.  Com-Scan has detected \nan energy field protecting an area \naround the sixth planet of the Hoth \nsystem.  The field is strong enough \nto deflect any bombardment.\n\nVADER\n(angrily)\n\nThe Rebels are alerted to our \npresence.  Admiral Ozzel came out \nof light-speed too close to the \nsystem.\n\nVEERS\nHe felt surprise was wiser...\n\nVADER\nHe is as clumsy as he is stupid. \nGeneral, prepare your troops for a \nsurface attack.\n\nVEERS\nYes, my lord.\n\nVeers turns smartly and leaves as Vader activates a large \nviewscreen showing the bridge of his mighty ship.  Admiral \nOzzel appears on the viewscreen, standing slightly in front \nof Captain Piett.\n\n22.\n\n\n\nOZZEL\nLord Vader, the fleet has moved out \nof light-speed, and we\u0027re preparing \nto... Aaagh!\n\nVADER\nYou have failed me for the last \ntime, Admiral.  Captain Piett.\n\nPiett steps forward, as the admiral moves away, slightly \nconfused, touching his throat as it begins to constrict \npainfully.\n\nPIETT\nYes, my lord.\n\nVADER\nMake ready to land out troops \nbeyond the energy shield and deploy \nthe fleet so that nothing gets off \nthat system.  You are in command \nnow, Admiral Piett.\n\nPIETT\nThank you, Lord Vader.\n\nPiett\u0027s pleasure about his unexpected promotion is not an \nunmixed emotion.  He glances warily at the struggling \nAdmiral Ozzel who, with a final choke, stumbles and falls in \na lifeless heap before him.\n\nINT. REBEL BASE - MAIN HANGAR DECK36 36\n\nWith a sense of urgency, Leia quickly briefs a group of \npilots gathered in the center of the hangar.\n\nLEIA\nAll troop carriers will assemble at \nthe north entrance.  The heavy \ntransport ships will leave as soon \nas they\u0027re loaded.  Only two \nfighter escorts per ship.  The \nenergy shield can only be opened \nfor a short time, so you\u0027ll have to \nstay very close to your transports.\n\nHOBBIE\nTwo fighters against a Star \nDestroyer?\n\n23.\n\n\n\nLEIA\nThe ion cannon will fire several \nshots to make sure that any enemy \nships will be out of your flight \npath.  When you\u0027ve gotten past the \nenergy shield, proceed directly to \nthe rendezvous point.  Understood?\n\nPILOTS\n(in unison)\n\nRight.  Okay.\n\nLEIA\nGood luck.\n\nDERLIN\nOkay.  Everyone to your stations. \nLet\u0027s go!\n\nThe pilots hurry away.\n\nEXT. HOTH - ICE PLAIN - SNOW TRENCH - DAY37 37\n\nRebel troops carry heavy bazooka-type weapons and position \nthem along the snow trench.  Men hurriedly respond to their \nofficers\u0027 yelled orders and brace themselves against the \nrhythmic gusts of bitter-cold wind.\n\nOther troops load power packs into a gun turret and swing \nits guns into position.\n\nEXT. HOTH - ICE PLAIN - POWER GENERATORS38 38\n\nNear the base power generators, troops rush to set up their \nheavy battle equipment.  Buzzing loudly, the generators send \nalong, sparking fingers of energy into the bitter Hoth wind.\n\nINT. REBEL BASE - COMMAND CENTER39 39\n\nThe long line of Rebel controllers is tense, as are Princess \nLeia and General Rieekan, who are trying very hard not to \nshow any fear.\n\nRIEEKAN\nTheir primary target will be the \npower generators.  Prepare to open \nthe shield.\n\nEXT. ICE PLAIN40 40\n\nThe Rebel transport and two escort fighters begin their \ndeparture from the ice planet.\n\n24.\n\n\n\nEXT. SPACE - IMPERIAL STAR DESTROYER41 41\n\nA huge Imperial Star Destroyer rest against a sea of stars, \nfar above the white surface of the planet Hoth.\n\nINT. IMPERIAL STAR DESTROYER - BRIDGE42 42\n\nAn Imperial controller approaches his commander.\n\nCONTROLLER\nSir, Rebel ships are coming into \nour sector.\n\nCAPTAIN\nGood.  Our first catch of the day.\n\nINT. REBEL BASE - COMMAND CENTER43 43\n\nWOMAN CONTROLLER\nStand by, ion control... Fire!\n\nEXT. REBEL BASE ICE CAVE - ION CANNON44 44\n\nThe giant ball-shaped ion cannon rotates into position and \nblasts two red energy beams skyward.\n\nEXT. SPACE - HOTH - REBEL TRANSPORT45 45\n\nThe Rebel transport and its escort race away from the white \nplanet, closely followed by the two red energy beams.\n\nAs the Rebel transport races toward the waiting Imperial \nStar Destroyer, it is overtaken by the two scarlet energy \nbolts.  The Imperial Star Destroyer is hit in the conning \ntower by the powerful bolts, which set up fiery explosions \non its metal hull.\n\nThe big Star Destroyer veers, then spins wildly out of \ncontrol.  As the Imperial ship careers into deep space, the \nRebel transport races away to safety.\n\nINT. REBEL BASE - MAIN HANGAR DECK46 46\n\nPilots, gunners, and troopers hurry to their stations and \ntheir vehicles.\n\nANNOUNCER\n(over loudspeaker)\n\nThe first transport is away.\n\nEveryone cheers at the announcement, which echoes through \nthe hangar. Luke turns and walks on, heading toward his \nsnowspeeder.  His gunner, Dack, a fresh-faced, eager kid, is \nglad to see him.  They climb in.\n\n25.\n\n\n\nDACK\nFeeling all right, sir?\n\nLUKE\nJust like new, Dack.  How about \nyou?\n\nDACK\nRight now I feel like I could take \non the whole Empire myself.\n\nLUKE\n(quietly, strapping in)\n\nI know what you mean.\n\nEXT. HOTH - ICE PLAIN47 47\n\nA thin horizon line cuts across the bleak landscape.  Small \ndot-size objects begin to appear on the horizon, moving in \nthe direction of the Rebel base.\n\nEXT. HOTH - ICE PLAIN - SNOW TRENCH48 48\n\nA Rebel officer lifts a pair of electrobinoculars to his \neyes.  Through the lens he sees a very close view of a giant \nImperial snow walker.  He adjusts the view which then zooms \nback to reveal three more of the ominous battle machines.  \nSmall flashes of yellow fire billow from the guns of the \nlumbering snow walkers.\n\nThe officer lowers his binoculars as the regular rhythmic \npounding begins to make the ground vibrate.  The pounding \ngrows louder and is accompanied by a high-pitched, metallic \nrattling.  The officer speaks into his comlink.\n\nTRENCH OFFICER\nEcho Station Three-T-Eight.\n\nINT. REBEL BASE - CORRIDOR49 49\n\nPilots and gunners race to their waiting snowspeeders.  Ice \nand snow begin falling from the walls of the corridor, \nshaken by the pounding Imperial snow walker as they draw \never nearer.\n\nTRENCH OFFICER\n(over comlink)\n\nWe have spotted Imperial walkers!\n\nCONTROLLER\nImperial walkers on the north \nridge.\n\n26.\n\n\n\nEXT. HOTH - ICE PLAIN - SNOW TRENCH50 50\n\nThe Rebel troops aim their weapons at the horizon as \nexplosions erupt all around them.  They are nervous and \ntheir grip on their weapons tightens from the cold and from \nfear.\n\nBehind the troops a dozen snowspeeders race through the sky.\n\nINT. LUKE\u0027S SNOWSPEEDER, ROGUE LEADER - COCKPIT51 51\n\nLUKE\n(into comlink)\n\nEcho station Five-Seven.  We\u0027re on \nour way.\n\nEXT. HOTH - ICE PLAIN - BATTLEFIELD52 52\n\nThe fleet of snowspeeders races above the ice field at full \nthrottle. They accelerate away from the base and head toward \nthe distant walkers.\n\nINT. LUKE\u0027S SNOWSPEEDER, ROGUE LEADER - COCKPIT53 53\n\nLUKE\n(into comlink)\n\nAll right, boys, keep tight now.\n\nDACK\nLuke, I have no approach vector. \nI\u0027m not set.\n\nLUKE\nSteady, Dack.  Attack pattern \ndelta.  Go now!\n\nEXT. HOTH - ICE PLAIN - BATTLEFIELD54 54\n\nThe cannons mounted on the walker head fire at the speeders.  \nOther walkers loom in the background.  Two speeders race \naway past two of the enormous walkers and bank to the right.\n\nINT.  LUKE\u0027S SNOWSPEEDER, ROGUE LEADER - COCKPIT55 55\n\nLUKE\nAll right, I\u0027m coming in.\n\nHe turns his speeder and heads directly at one of the \nwalkers, flying toward its towering legs.  The horizon \ntwists as the speeder banks between the legs.\n\nLUKE (CONT’D)\n(into comlink)\n\nHobbie, you still with me?\n\n27.\n\n\n\nEXT. HOTH - ICE PLAIN - BATTLEFIELD56 56\n\nTwo speeders race directly at the head of a walker, then \nsplit and fly past it.\n\nThree other walkers march onward, firing all cannons.\n\nEXT. HOTH - ICE PLAIN - SNOWTRENCH57 57\n\nRebel troops fire on the approaching walkers, as the snow \nand ice explode all around them.\n\nEXT. HOTH - ICE PLAIN - BATTLEFIELD58 58\n\nA speeder banks through and away from the legs of a walker.  \nTwo other speeders pass the first speeder from the opposite \ndirection.  Other Rebel craft race just above the icy plain.\n\nA giant walker head swivels and fires, striking a \nsnowspeeder and sending it crashing in a ball of flames.\n\nINT. IMPERIAL SNOW WALKER - COCKPIT59 59\n\nGeneral Veers and two walker pilots keep a careful eye on \nthe racing Rebel snowspeeders as they maneuver their \nlumbering war machine forward.\n\nLuke\u0027s speeder banks in from the side of Veers\u0027s walker and \nheads straight for its viewport, blasting away.  An \nexplosion hits the walker window, but dissipates, doing no \nharm.  The speeder roars up and over the impregnable war \nmachine.\n\nINT.  LUKE\u0027S SNOWSPEEDER, ROGUE LEADER - COCKPIT60 60\n\nLuke looks back at the walker as it grows smaller in the \ndistance.\n\nLUKE\nThat armor\u0027s too strong for \nblasters.\n\nOn the horizon, another walker moves up past Luke\u0027s cockpit \nwindow, twisting out of sight as Luke banks and starts \nanother run.\n\nLUKE (CONT’D)\n(into comlink)\n\nRogue Group, use your harpoons and \ntow cables.  Go for the legs. It \nmight be our only chance of \nstopping them.\n\n(to Dack)\nAll right, stand by, Dack.\n\n28.\n\n\n\nDack is at the gunner\u0027s controls.\n\nDACK\nLuke, we\u0027ve got a malfunction in \nfire control.  I\u0027ll have to cut in \nthe auxiliary.\n\nLUKE\nJust hang on.  Hang on, Dack.  Get \nready to fire that tow cable.\n\nBarely keeping his seat in the tumbling ship, Dack struggles \nto set up his harpoon gun.\n\nLuke swings his speeder around and heads toward an oncoming \nwalker. Laser bolts and flak fill the air, creating a deadly \nobstacle course for the tiny craft.\n\nEXT. HOTH - ICE PLAIN - BATTLEFIELD61 61\n\nRogue Leader and another snowspeeder fly in tight formation \ntoward the walker as explosions burst all around them.\n\nINT.  LUKE\u0027S SNOWSPEEDER, ROGUE LEADER - COCKPIT62 62\n\nAfter sustaining a heavy volley of fire, Luke turns around \nto see if Dack is all right.\n\nLUKE\nDack?  Dack!\n\nDack is lost.  Blood streams down his forehead, which rests \non his smoldering controls.  Out the back window, an \nImperial walker recedes in the distance.\n\nEXT. HOTH - ICE PLAIN - SNOW TRENCH AREA63 63\n\nRebel troops fire the dishlike ray gun while explosions \nerupt around them.\n\nEXT. HOTH - ICE PLAIN - BATTLEFIELD64 64\n\nTwo walkers lumber toward the Rebel base as a speeder \nbetween them explodes in a ball of flames.\n\nEXT. HOTH - ICE PLAIN - SNOW TRENCH65 65\n\nThe dislike ray gun is hit by a laser bolt and instantly \nexplodes.\n\nINT. IMPERIAL SNOW WALKER - COCKPIT66 66\n\nThrough the cockpit window, Veers and his pilot can see the \nRebel power generators in the distance.\n\n29.\n\n\n\nA hologram of Darth Vader appears on a control panel screen.\n\nVEERS\nYes, Lord Vader.  I\u0027ve reached the \nmain power generator.  The shield \nwill be down in moments.  You may \nstart your landing.\n\nINT.  LUKE\u0027S SNOWSPEEDER, ROGUE LEADER - COCKPIT67 67\n\nLUKE\n(into comlink)\n\nRogue Three.\n\nINT. WEDGE\u0027S SNOWSPEEDER, ROGUE THREE - COCKPIT68 68\n\nWEDGE\n(into comlink)\n\nCopy, Rogue Leader\n\nLUKE\n(over comlink)\n\nWedge, I\u0027ve lost my gunner.  You\u0027ll \nhave to make this shot.  I\u0027ll cover \nfor you.  Set your harpoon.  Follow \nme on the next pass.\n\nWEDGE\n(into comlink)\n\nComing around, Rogue Leader.\n\nINT.  LUKE\u0027S SNOWSPEEDER, ROGUE LEADER - COCKPIT69 69\n\nLUKE\n(into comlink)\n\nSteady, Rogue Two\n\nEXT. HOTH - BATTLEFIELD70 70\n\nWedge\u0027s speeder races through the legs of one of the \nmonstrous walkers.\n\nINT. WEDGE\u0027S SNOWSPEEDER, ROGUE THREE - COCKPIT71 71\n\nWEDGE\n(to gunner)\n\nActivate harpoon.\n\nWedge\u0027s gunner reaches for a firing switch to activate the \nharpoon. The harpoon flashes out, and speeds toward the \nreceding legs of the walker.\n\n30.\n\n\n\nEXT. HOTH - BATTLEFIELD72 72\n\nThe harpoon hurtles toward the walker, In an instant it is \nembedded in one of the walker\u0027s legs.\n\nINT. WEDGE\u0027S SNOWSPEEDER, ROGUE THREE - COCKPIT73 73\n\nWEDGE\n(to gunner)\n\nGood shot, Janson.\n\nEXT. HOTH - BATTLEFIELD74 74\n\nThe speeder Rogue Three races around one of the giant \nwalker\u0027s feet, trailing the cable behind it.  Continuing \naround the back foot, Rogue Three then circles the walker \naround the tail end.\n\nINT. WEDGE\u0027S SNOWSPEEDER, ROGUE THREE - COCKPIT75 75\n\nWedge checks his controls and banks around the front of the \nwalker.\n\nWEDGE\nOne more pass.\n\nJANSON\nComing around.  Once more.\n\nEXT. HOTH - BATTLEFIELD76 76\n\nThe speeder sweeps left to right in front of the giant legs, \ntowing the cable behind it.\n\nINT. WEDGE\u0027S SNOWSPEEDER, ROGUE THREE - COCKPIT77 77\n\nJANSON\nOnce more.\n\nWedge swings the speeder between the legs of the giant \nwalker.\n\nJANSON (CONT’D)\nCable out!  Let her go!\n\nWEDGE\nDetach cable.\n\nEXT. WEDGE\u0027S SNOWSPEEDER, ROGUE THREE78 78\n\nThe cable release on the back of the speeder snaps loose and \nthe cable drops away.\n\n31.\n\n\n\nINT. WEDGE\u0027S SNOWSPEEDER, ROGUE THREE - COCKPIT79 79\n\nJANSON\nCable detached.\n\nEXT. HOTH - BATTLEFIELD80 80\n\nThe speeder zooms away into the distance.  The tangled legs \nof the enormous war machine attempt a step, but as they do \nthe giant Imperial walker begins to topple.  It teeters for \na moment, and then crashes onto the icy ground, sending snow \nand metal pieces flying.\n\nEXT. HOTH - ICE PLAIN - SNOW TRENCH81 81\n\nThe troops in the trenches cheer at the sight of the \ncrashing walker.\n\nAn officer gives a signal to his men and Rebel troops charge \nthe fallen war machine.\n\nTRENCH OFFICER\nCome on!\n\nThe troops run toward the downed walker, followed by two \nRebel speeders flying overhead.  Just as they reach the \nwalker, it explodes, the impact throwing some of the men \nonto the frozen ground.\n\nINT. WEDGE\u0027S SNOWSPEEDER, ROGUE THREE - COCKPIT82 82\n\nWedge lets out a triumphant yell, banking his speeder away \nfrom the fallen walker.\n\nWEDGE\n(into comlink)\n\nWhooha!  That got him!\n\nINT.  LUKE\u0027S SNOWSPEEDER, ROGUE LEADER - COCKPIT83 83\n\nLUKE\n(into comlink)\n\nI see it, Wedge.  Good work.\n\nINT. REBEL BASE - COMMAND CENTER84 84\n\nLarge chunks of ice tumble into the command center as Leia \nand General Rieekan monitor computer screens.\n\nRIEEKAN\nI don\u0027t think we can protect two \ntransports at a time.\n\n32.\n\n\n\nLEIA\nIt\u0027s risky, but we can\u0027t hold out \nmuch longer.  We have no choice.\n\nRIEEKAN\n(into comlink)\n\nLaunch patrols.\n\nLEIA\n(to an aide)\n\nEvacuate remaining ground staff.\n\nINT. REBEL BASE - MAIN HANGAR85 85\n\nMuffled distant explosions create widening cracks in the ice \nroof of the hangar.  Trying to ignore the noise and falling \nbits of snow, Han works on one of the Falcon\u0027s lifters while \nChewie works on one of the wings.  Noticing Chewie attach a \nwrong part, Han grows impatient.\n\nHAN\nNo, no!  No!  This one goes there, \nthat one goes there.  Right?\n\nIn another area of the hangar, Threepio watches as Artoo is \nraised up into Luke\u0027s X-wing fighter.\n\nTHREEPIO\nArtoo, you take good care of Master \nLuke now, understand?  And ... do \ntake good care of yourself. Oh, \ndear, oh, dear.\n\nEXT. HOTH - BATTLEFIELD86 86\n\nThe fierce battle on the vast snow plains of Hoth rages on.  \nThe Imperial walkers continue their slow, steady assault on \nthe Rebel base, firing lasers as they lumber ever onward.  \nIn the snow trench, Rebel troops fire large bazookalike guns \nand dishlike ray guns as explosions erupt around them.  A \ngun tower is hit by a laser bolt and instantly explodes.  \nAnother blast destroys a ray gun.\n\nINT. IMPERIAL SNOW WALKER - COCKPIT87 87\n\nGeneral Veers studies various readouts on his control panel.\n\nVEERS\nAll troops will debark for ground \nassault.  Prepare to target the \nmain generator.\n\n33.\n\n\n\nEXT. HOTH - BATTLEFIELD88 88\n\nLuke\u0027s speeder and Rogue Two fly in formation, banking from \nright to left and flying above the erupting battlefield.  \nFlak bursts all around them.\n\nINT.  LUKE\u0027S SNOWSPEEDER, ROGUE LEADER - COCKPIT89 89\n\nLuke, glancing over, sees Rogue Two on his left.  His ship \nshudders as flak bursts nearby.\n\nLUKE\n(into comlink)\n\nRogue Two, are you all right?\n\nINT. ZEV\u0027S SNOWSPEEDER, ROGUE TWO - COCKPIT90 90\n\nZEV\n(into comlink)\n\nYeah.  I\u0027m with you, Rogue Leader.\n\nINT.  LUKE\u0027S SNOWSPEEDER, ROGUE LEADER - COCKPIT91 91\n\nLUKE\n(into comlink)\n\nWe\u0027ll set harpoon.  I\u0027ll cover for \nyou.\n\nEXT. HOTH - BATTLEFIELD92 92\n\nThe two speeders race across the horizon toward the giant \nwalkers.\n\nINT. ZEV\u0027S SNOWSPEEDER, ROGUE TWO - COCKPIT93 93\n\nZEV\n(into comlink)\n\nComing around.\n\nINT.  LUKE\u0027S SNOWSPEEDER, ROGUE LEADER - COCKPIT94 94\n\nLUKE\n(into comlink)\n\nWatch that cross fire, boys.\n\nINT. ZEV\u0027S SNOWSPEEDER, ROGUE TWO - COCKPIT95 95\n\nZEV\n(into comlink)\n\nSet for position three.\n(to gunner)\n\nSteady.\n\n34.\n\n\n\nLUKE\n(over comlink)\n\nStay tight and low.\n\nEXT. ZEV\u0027S SNOWSPEEDER, ROGUE TWO96 96\n\nLuke\u0027s speeder moves in formation with Rogue Two, when \nsuddenly Zev\u0027s speeder is hit by a laser bolt.  His ship \nbucks violently under the impact and the cockpit explodes in \na ball of flame.\n\nSpewing smoke, the speeder hurtles toward a looming walker.  \nBefore they collide.  Rogue Two explodes in a million \nflaming pieces.\n\nINT. LUKE\u0027S SNOWSPEEDER, ROGUE LEADER - COCKPIT97 97\n\nDesperately, Luke works the controls of his flak-buffeted \nship. Suddenly, the speeder is rocked by a huge explosion.  \nLuke struggles with the controls with a look of terror on \nhis face.  The speeder fills with smoke, and electrical \nsparks jump about the cockpit.\n\nLUKE\n(into comlink)\n\nHobbie, I\u0027ve been hit!\n\nINT. REBEL BASE - COMMAND CENTER98 98\n\nApart from the distant thunder of laser blasts, the corridor \nis strangely quiet and empty.  Running footsteps echo \nthrough the freezing hallway, then Han appears.  Cracks have \nappeared in some of the walls and some pipes have broken, \nsending hot steam billowing into the underground hallways.  \nHan hurries into the command center.  It is a shambles, but \nsome people are still at their posts.  As he enters, a \ngigantic cave-in almost obliterates the room.  He finds Leia \nand Threepio near one of the control boards.\n\nHAN\nYou all right?\n\nLeia nods.  She is surprised to see him.\n\nLEIA\nWhy are you still here?\n\nHAN\nI heard the command center had been \nhit.\n\nLEIA\nYou got your clearance to leave.\n\n35.\n\n\n\nHAN\nDon\u0027t worry.  I\u0027ll leave.  First \nI\u0027m going to get you to your ship.\n\nTHREEPIO\nYour Highness, we must take this \nlast transport.  It\u0027s our only \nhope.\n\nLEIA\n(to controller)\n\nSend all troops in sector twelve to \nthe south slope to protect the \nfighters.\n\nA blast rocks the command center, throwing Threepio backward \ninto Han\u0027s arms.\n\nANNOUNCER\n(over loudspeaker)\n\nImperial troops have entered the \nbase.\n\nHAN\nCome on... that\u0027s it.\n\nLEIA\n(to head controller)\n\nGive the evacuation code signal. \nAnd get to your transports!\n\nLeia looks exhausted.  Han grabs her and starts to lead her \nout.\n\nAs Han, Leia, and Threepio run out of the command center, \nthe code signal can be heard echoing off the corridor walls.\n\nHEAD CONTROLLER\nK-one-zero... all troops disengage.\n\nTHREEPIO\n(to Han and Leia)\n\nOh!  Wait for me!\n\nEXT. BATTLEFIELD - SNOW TRENCH99 99\n\nRebel troops retreat under the awesome Imperial onslaught.\n\nOFFICER\nBegin retreat!\n\nSECOND OFFICER\nFall back!\n\n36.\n\n\n\nTroops flee from the battle, the ground exploding around \nthem.\n\nEXT. HOTH - BATTLEFIELD100 100\n\nThree of the giant walkers, firing lasers, advance toward \nthe Rebel headquarters.\n\nEXT. HOTH - SNOW TRENCH101 101\n\nContinuing their retreat, the Rebels see the walkers looming \never nearer.\n\nEXT. HOTH - BATTLEFIELD - ICE PLAIN102 102\n\nOn the battlefield, Luke watches as a walker foot rises and \nmoves over him.  He looks up at the underbelly of the huge \nwalker, passing overhead.\n\nRunning beneath the monstrous machine, Luke fires his \nharpoon gun at the walker\u0027s underside.  A thin cable follows \nthe projectile from the gun.  The magnetic head and cable \nattach firmly to the metal hull.\n\nStill running under the walker, Luke attaches the cable drum \nto his belt buckle.  Soon he is pulled up the cable and \nhangs dangling underneath the walker.\n\nThe walker\u0027s giant feet continue to pound onward across the \nfrozen snow.  Stray laser bolts whistle by Luke as he climbs \nup the cable to the walker\u0027s hull, reaching a small hatch.  \nHanging precariously, Luke cuts the solid metal hatch with \nhis laser sword.\n\nHe takes a landmine from around his neck and throws it \ninside the Imperial machine.  Quickly, Luke starts down the \ncable and crashes onto the icy ground far below.  He lies \nunconscious as a giant rear leg passes by - and just misses \nhim.\n\nThe giant walker stops in mid-step.  A muffled explosion \ncomes from within - and then the walker\u0027s mechanical insides  \nare spewed out every conceivable opening.  The machine sits \ndead in its tracks, smoking like a locomotive on stilts.\n\nEXT. HOTH - BATTLEFIELD103 103\n\nVeers\u0027s walker continues to advance toward the Rebel base.  \nThe smoldering walker that Luke exploded stands smoking just \nto the right of Veers\u0027s path.\n\n37.\n\n\n\nINT. IMPERIAL SNOW WALKER - COCKPIT104 104\n\nInside his walker, General Veers prepares to fire on the \nRebel power generators.\n\nVEERS\nDistance to power generators?\n\nPILOT\nOne-seven, decimal two-eight.\n\nVeers reaches for the electrorangefinder and lines up the \nmain generator.\n\nVEERS\nTarget.  Maximum fire power.\n\nEXT. HOTH - BATTLEFIELD105 105\n\nThe Rebel troops continue their desperate retreat, pushed \nback by the relentless Imperial assault.\n\nINT. HOTH - REBEL BASE - ICE CORRIDORS106 106\n\nWith Threepio lagging behind, Han and Leia race through the \ncrumbling ice corridors.  Suddenly, there is an explosion.  \nHan turns, grabs the princess, and pulls her to the wall as \na tremendous cave-in blacks their path.\n\nHe takes the comlink from his pocket.\n\nHAN\n(into comlink)\n\nTransport, this is Solo.  Better \ntake off - I can\u0027t get to you. I\u0027ll \nget the princess out on the Falcon.\n\nHan and Leia turn and race down the corridor.\n\nTHREEPIO\nBut... but... but... where are you \ngoing?  Uh... come back!!\n\nINT. HOTH - REBEL BASE - COMMAND CENTER107 107\n\nImperial troops have reached the base.  As they push through \nthe blocked passageway, Darth Vader strides behind them.\n\nINT. HOTH - REBEL BASE - ICE CORRIDOR108 108\n\nHan and Leia run toward the entrance of the main hangar \nwhere the Millennium Falcon is docked.  Threepio still lags \nbehind.\n\n38.\n\n\n\nTHREEPIO\nWait!  Wait for me!  Wait!  Stop!\n\nThe door to the hangar closes in his face.\n\nTHREEPIO (CONT’D)\n(exasperated)\n\nHow typical.\n\nQuickly, the door reopens as Han reaches out and pulls the \ngolden droid through.\n\nHAN\nCome on.\n\nINT. HOTH - REBEL BASE - MAIN HANGAR109 109\n\nChewie paces under the shelter of the Millennium Falcon\u0027s \nlanding gear. The giant Wookiee pats the underbelly of his \nbeloved ship and barks a few reassuring words.  As he \nsearches worriedly for his captain, something at last \ncatches his eye.\n\nChewie lets out a relieved shriek at seeing Han and Leia \nrunning toward the ship.  The Wookiee runs out into the \nfalling ice, lets out a howl, then runs up the ship\u0027s ramp.  \nHan and Leia run up the ramp after him, closely followed by \nThreepio.\n\nHAN\nHurry up, goldenrod, or you\u0027re \ngoing to be a permanent resident!\n\nTHREEPIO\nWait!  Wait!\n\nINT. HOTH - REBEL BASE - ICE CORRIDOR110 110\n\nImperial troops run through the base corridors.  Vader \nsurveys the place.  A huge chunk falls, almost hitting him, \nbut  he calmly, purposefully, continues around it.\n\nINT. REBEL BASE - MAIN HANGER - MILLENNIUM FALCON111 111\n\nA distant, huge, explosion rocks the hangar deck.  Ice cakes \ncome crashing down on the Millennium Falcon.\n\nINT. MAIN HANGAR - MILLENNIUM FALCON - MAIN HOLD112 112\n\nHan, standing before a control panel, is busy flipping \nswitches as Chewie watches a troublesome gauge.  A worried \nLeia observes their efforts.\n\n39.\n\n\n\nHAN\n(to Chewie)\n\nHow\u0027s this?\n\nThe Wookiee barks a negative reply.\n\nLEIA\nWould it helped if I got out and \npushed?\n\nHAN\nIt might.\n\nThreepio clanks into the hold.\n\nTHREEPIO\nCaptain Solo, Captain Solo... sir, \nmight I suggest that you...\n\nHan gives the gold robot a devastating look.\n\nTHREEPIO (CONT’D)\nIt can wait.\n\nINT. MAIN HANGAR - MILLENNIUM FALCON - COCKPIT113 113\n\nThey move to the cockpit where Han flips some more switches.  \nLeia watches him, impatient, disbelieving.\n\nLEIA\nThis bucket of bolts is never going \nto get us past that blockade.\n\nHAN\nThis baby\u0027s got a few surprises \nleft in her, sweetheart.\n\nHan and Leia look out the cockpit window and see a squad of \nstormtroopers rushing into the far side of the hangar.\n\nQuickly, Han straps himself into the pilot\u0027s seat and Leia \ninto the navigator\u0027s chair.\n\nINT. HOTH - REBEL BASE - MAIN HANGAR114 114\n\nStormtroopers hurriedly set up a large bazookalike weapon.  \nBehind them the giant hangar doors open slowly.\n\nEXT. MAIN HANGAR - MILLENNIUM FALCON115 115\n\nA laser gun appears on the Falcon and swings around to aim \nat the Imperial troops.\n\n40.\n\n\n\nThe stormtroopers, preparing to fire their bazooka cannon, \nare hit by the Falcon\u0027s fire and are thrown about in all \ndirections.\n\nINT. MAIN HANGAR - MILLENNIUM FALCON - COCKPIT116 116\n\nChewie rushes into the cockpit.\n\nHAN\nCome on!  Come on!  Switch over. \nLet\u0027s hope we don\u0027t have a burnout.\n\nA laser hits the window near Chewie as he is settling into \nhis chair. Letting out a loud whelp, Chewie quickly pulls \nback on the controls and the first stage of engine fire can \nbe heard.  Han flashes a big grin at Leia.\n\nHAN (CONT’D)\nSee?\n\nLEIA\nSomeday you\u0027re going to be wrong, \nand I hope I\u0027m there to see it.\n\nHan looks at Chewie.\n\nHAN\nPunch it!\n\nThe roar of the Falcon\u0027s main engines blasts out everything \nas the ice- cave wall rushes by outside the cockpit window.\n\nINT. REBEL BASE - MAIN HANGAR117 117\n\nMore stormtroopers run into the hangar, closely followed by \nVader. Hearing the loud roar of the Millennium Falcon\u0027s \nengines, Vader looks toward the main hangar doors just in \ntime to see the Falcon lift up and disappear outside the \ncave.\n\nEXT. HOTH - ICE SLOPE - DAY118 118\n\nLuke and two other pilots look up as the Millennium Falcon \nraces above them, flying very close to the ground.\n\nThe three pilots turn then, and trudge onward toward their X-\nwing fighters, each going to his own ship.  Luke waves \nfarewell, then heads toward his own fighter.\n\nArtoo, seated on his cubbyhole, chirps an excited greeting \nas Luke climbs aboard the spacecraft.\n\nLUKE\nArtoo!  Get her ready for takeoff.\n\n41.\n\n\n\nFrom his ship, Luke sees Wedge in his own X-wing, preparing \nfor takeoff.\n\nWEDGE\nGood luck, Luke.  See you at the \nrendezvous.\n\nLuke smiles and nods at Wedge, then lowers himself into the \ncockpit of his X-wing while Artoo waits in the cubbyhole, \nbeeping impatiently.\n\nLUKE\nDon\u0027t worry, Artoo.  We\u0027re going, \nwe\u0027re going.\n\nThe canopy over the X-wing lowers and snaps shut.\n\nEXT. SPACE -  LUKE\u0027S X-WING119 119\n\nLuke\u0027s fighter, its wings closed, speeds away from the icy \nplanet. Soon it disappears into the stars.\n\nINT.  LUKE\u0027S X-WING - COCKPIT120 120\n\nLuke, looking thoughtful, suddenly makes a decision.  He \nflips several switches.  The stars shift as he takes his \nfighter into a steep turn. The X-wing banks sharply and \nflies away in a new direction.\n\nThe monitor screen on Luke\u0027s control panel prints out a \nquestion from the concerned Artoo.\n\nLUKE\n(into comlink)\n\nThere\u0027s nothing wrong, Artoo. I\u0027m \njust setting a new course.\n\nArtoo beeps once again.\n\nLUKE (CONT’D)\n(into comlink)\n\nWe\u0027re not going to regroup with the \nothers.\n\nArtoo begins a protest, whistling an unbelieving, \"What?!\"\n\nLuke reads Artoo\u0027s exclamation on his control panel.\n\nLUKE (CONT’D)\n(into comlink)\n\nWe\u0027re going to the Dagobah system.\n\n42.\n\n\n\nLuke checks his readouts and makes a few adjustments.  He \nrides along with only the soft hum of the instruments to \nbreak the silence. Finally, Artoo chirps up.\n\nLUKE (CONT’D)\n(into comlink)\n\nYes, Artoo?\n\nArtoo utters a soft, carefully phrased steam of whistles.\n\nLUKE (CONT’D)\n(into comlink, chuckling)\n\nThat\u0027s all right.  I\u0027d like to keep \nit on manual control for a while.\n\nThe little droid lets out a defeated whimper.  Luke smiles, \nand continues on his course.\n\nEXT. SPACE - MILLENNIUM FALCON121 121\n\nThe Millennium Falcon speeds away from Hoth, closely \nfollowed by one huge Star Destroyer and four tiny TIE \nfighters.\n\nAs it is pursued, the Falcon races toward two very bright \nstar-sized objects.\n\nINT. MILLENNIUM FALCON - COCKPIT122 122\n\nInside the cockpit, Chewie lets out a loud howl.  Han checks \nas the ship is buffeted by exploding flak.  He appears to be \ndoing six things at once.\n\nHAN\n(harried)\n\nI saw them!  I saw them!\n\nLEIA\nSaw what?\n\nHAN\nStar Destroyers, two of them, \ncoming right at us.\n\nThreepio bumps and bangs his way into the cockpit.\n\nTHREEPIO\nSir, sir!  Might I suggest...\n\nHAN\n(to Leia)\n\nShut him up or shut him down!\n(to Chewie)\n\nCheck the deflector shield!\n\n43.\n\n\n\nChewie barks a reply as he readjusts an overhead switch.\n\nHAN (CONT’D)\nOh, great.  Well, we can still \noutmaneuver them.\n\nEXT. SPACE - MILLENNIUM FALCON - STAR DESTROYERS123 123\n\nThe Millennium Falcon races toward one of the huge oncoming \nStar Destroyers.  Suddenly, the Falcon starts into a deep \ndive straight down, closely followed by four TIE fighters.  \nThe underside of the Star Destroyer continues on a collision \ncourse with two oncoming Star Destroyers.  Slowly, it starts \nto veer to the left.\n\nINT. STAR DESTROYER - BRIDGE124 124\n\nOut the front window, the two approaching Star Destroyers \ncan be seen veering to the left.\n\nIMPERIAL OFFICER\nTake evasive action!\n\nAlarms sound all over the huge ship.  The two other Star \nDestroyers get closer, one of them moving over the bridge so \nclose that it makes brushing contact with it.\n\nEXT. SPACE - MILLENNIUM FALCON - TIE FIGHTERS125 125\n\nThe Millennium Falcon races away from the colliding Star \nDestroyers, still followed by four TIE fighters.  Laser \nbolts spark the pitch-black skies.\n\nINT. MILLENNIUM FALCON - COCKPIT126 126\n\nThings have calmed down a bit, but the race isn\u0027t over yet.  \nChewie barks at Han.  Leia is still trying to recover from \nthe steep dive. The ship is buffeted by laser blasts.\n\nHAN\nPrepare to make the jump to light- \nspeed.\n\nTHREEPIO\nBut, sir!\n\nThe buffeting of lasers becomes louder and stronger.\n\nLEIA\nThey\u0027re getting closer!\n\nHAN\n(with a gleam in his eye)\n\nOh yeah?  Watch this.\n\n44.\n\n\n\nExpectantly, they look out the cockpit window as stars do \nnot go into hyperspace, but just sit there.\n\nHan and Chewie look at each other and are thrown into an \nacute state of concern.\n\nLEIA\nWatch what?\n\nHan tries again.  Still nothing.\n\nHAN\nI think we\u0027re in trouble.\n\nTHREEPIO\nIf I may say so, sir, I noticed \nearlier that the hyperdrive \nmotivator has been damaged.  It\u0027s \nimpossible to go to light-speed!\n\nHAN\nWe\u0027re in trouble!\n\nThe explosions become heavier.\n\nEXT. SPACE - MILLENNIUM FALCON - TIE FIGHTERS - STAR 127 127\nDESTROYER\n\nThe Falcon races into the starry vastness, followed by the \nfour Imperial TIE fighters and an Imperial Star Destroyer.\n\nINT. MILLENNIUM FALCON - COCKPIT128 128\n\nStars race by as flak bursts outside the Falcon\u0027s window.\n\nINT. MILLENNIUM FALCON - HOLD129 129\n\nHan works furiously at some control panels while giving \nvarious orders to Chewie.\n\nHAN\nHorizontal boosters...!\n\n(Chewie barks)\nAlluvial dampers...!  Well that\u0027s \nnot it.\n\n(Chewie barks)\nBring me the hydrospanners!\n\nChewie hurries over to the pit and places the tools on the \nedge.\n\nHAN (CONT’D)\nI don\u0027t know how we\u0027re going to get \nout of this one.\n\n45.\n\n\n\nSuddenly, a loud thump hits the side of the Falcon, causing \nit to lurch radically.  Chewie barks.  The tools fall into \nthe pit on top of Han.\n\nHAN (CONT’D)\nOww!  Chewie!\n\nMore turbulence rocks the ship.\n\nHAN (CONT’D)\nThat was no laser blast!  Something \nhit us.\n\nLEIA\n(over comlink)\n\nHan, get up here!\n\nHAN\nCome on, Chewie!\n\nHan climbs out of the hold like a shot.  Both he and Chewie \nrun out of the hold and toward the cockpit.\n\nINT. MILLENNIUM FALCON - COCKPIT130 130\n\nOut the front cockpit window, they see hundreds of asteroids \nracing by.\n\nLEIA\nAsteroids!\n\nHan changes places with Leia who has been at the controls, \nand Chewie gets into his chair.  Han works his controls as a \nchunk of rock crosses in front of the ship.\n\nHAN\nOh, no!  Chewie, set two-seven- \none.\n\nLEIA\nWhat are you doing?  You\u0027re not \nactually going into an asteroid \nfield?\n\nHAN\nThey\u0027d be crazy to follow us, \nwouldn\u0027t they?\n\nAnother asteroid thumps against the ship and Leia winces at \nthe jolt.\n\nLEIA\nYou don\u0027t have to do this to \nimpress me.\n\n46.\n\n\n\nTHREEPIO\nSir, the possibility of \nsuccessfully navigating an asteroid \nfield is approximately three \nthousand, seven hundred and twenty \nto one.\n\nHAN\nNever tell me the odds!\n\nEXT. ASTEROID BELT - MILLENNIUM FALCON131 131\n\nThe Falcon turns into the asteroid storm and as the ship \ncompletes its turn, asteroids start coming straight at the \ncockpit windows.\n\nA large asteroid tumbles away from the Falcon\u0027s path at top \nspeed. Several smaller asteroids crash into the big one, \ncreating small explosions on its surface.  Other asteroids \nof all sizes pass by in every direction, some colliding and \nexploding.  The tiny Millennium Falcon veers around the big \nasteroid and races past it through the rain of rocks, \nfollowed by four TIE fighters, which bob and weave around \nthe asteroids.\n\nOne of the pursuing TIE fighters connects with an asteroid \nand explodes.  The other fighters are pelted with a steady \nstream of smaller explosions.\n\nTwo huge asteroids tumble toward the Millennium Falcon, \nwhich quickly banks around both of them.  The three TIE \nfighters follow in hot pursuit until one of the fighters \nscrapes an asteroid and tumbles out of control into deep \nspace.\n\nEXT. SPACE - STAR DESTROYER - ASTEROID BELT132 132\n\nThe massive Star Destroyer blasts oncoming asteroids as it \nfollows the Falcon.  Smaller asteroids explode across its \nvast surface.\n\nEXT. MILLENNIUM FALCON - TIE FIGHTERS - ASTEROID BELT133 133\n\nThe Falcon twists on its side as it races around an oncoming \nasteroid. Two TIE fighters follow in the distance, coming \nfrom either side.\n\nINT. MILLENNIUM FALCON - COCKPIT134 134\n\nAsteroids race by the cockpit window as Han pilots his \ntrusty craft through the dangerous field.\n\nLooking out the cockpit window, the Falcon crew sees a big \nasteroid drop past the window, narrowly missing their ship.\n\n47.\n\n\n\nChewie barks in terror as a slightly smaller asteroid comes \nespecially close - to close - and bounces off the Falcon \nwith a loud crunch. Threepio\u0027s hands cover his eyes.  He \nmanages a short peek at the cockpit window.  Princess Leia \nsits stone-faced, staring at the action. Han gives her a \nquick look.\n\nHAN\nYou said you wanted to be around \nwhen I made a mistake; well, this \ncould be it, sweetheart.\n\nLEIA\nI take it back.  We\u0027re going to get \npulverized if we stay out here much \nlonger.\n\nThe group watches as more asteroids race by outside the \nwindow.\n\nHAN\nI\u0027m not going to argue with that.\n\nTHREEPIO\nPulverized?\n\nHAN\nI\u0027m going in closer to one of those \nbig ones.\n\nLEIA\nCloser?\n\nTHREEPIO\nCloser?!\n\nChewbacca barks the same word, only louder.\n\nEXT. MILLENNIUM FALCON - ASTEROID BELT135 135\n\nThe Millennium Falcon dives toward the surface of one of the \nmoon-sized asteroids.  There is a continued display of \nexplosions against the starry void as smaller asteroids \ncollide with larger chunks of rock. The two remaining TIE \nfighters follow the Falcon to the large asteroid. The Falcon \nskims the surface of the giant asteroid as, all the while, \nsmall asteroids explode on the surface of the ship.\n\nThe TIE fighters approach the Falcon, but a giant asteroid \nhurtles directly into their path.  As the asteroid continues \non its way, it leaves remains of the two exploded TIE \nfighters to tumble into deep space.\n\n48.\n\n\n\nINT. MILLENNIUM FALCON - COCKPIT136 136\n\nRattled by the violent rocking of the starship, Threepio is \nnearly in hysterics.\n\nTHREEPIO\nOh, this is suicide!\n\nHan notices something on his main scope and nudges his \nfaithful Wookiee, pointing.\n\nHAN\nThere.  That looks pretty good.\n\nLEIA\nWhat looks pretty good?\n\nHAN\nYeah.  That\u0027ll do nicely.\n\nTHREEPIO\n(to Leia)\n\nExcuse me, ma\u0027am, but where are we \ngoing?\n\nOut the cockpit window, they see that they are skimming the \nsurface of the enormous asteroid and nearing a large crater.\n\nEXT. MILLENNIUM FALCON - GIANT ASTEROID CRATER137 137\n\nThe Millennium Falcon dives into the huge crater and \ndisappears.\n\nINT. MILLENNIUM FALCON - COCKPIT138 138\n\nLEIA\nI hope you know what you\u0027re doing.\n\nHAN\nYeah, me too.\n\nINT. GIANT ASTEROID CRATER139 139\n\nThe Falcon races down into the crater.  The walls are barely \nvisible as the ship speed through the tunnellike opening.  A \nsmall cave appears on one side of the crater, and the Falcon \nturns, slows, and scoots into it.\n\nEXT. SPACE -  LUKE\u0027S X-WING140 140\n\nThe tiny X-wing speeds toward the cloud cover of Dagobah.  \nArtoo, riding on the back of the fighter, turns his head \nback and forth with some anxiety.\n\n49.\n\n\n\nINT.  LUKE\u0027S X-WING - COCKPIT141 141\n\nLuke watches Artoo\u0027s words as they are translated and \nscreened on the computer scope.\n\nLUKE\n(into comlink)\n\nYes, that\u0027s it.  Dagobah.\n\nArtoo beeps a hopeful inquiry.\n\nLUKE (CONT’D)\n(into comlink)\n\nNo, I\u0027m not going to change my mind \nabout this.\n\n(getting a little \nnervous)\n\nI\u0027m not picking up any cities or \ntechnology.  Massive life-form \nreadings, though.  There\u0027s \nsomething alive down there...\n\nArtoo beeps, this time a slightly worried question.\n\nLUKE (CONT’D)\n(into comlink)\n\nYes, I\u0027m sure it\u0027s perfectly safe \nfor droids.\n\nEXT. SPACE - DAGOBAH -  LUKE\u0027S X-WING142 142\n\nThe X-wing continues its flight through the twilight above \nthe cloud- covered planet.\n\nINT.  LUKE\u0027S X-WING - COCKPIT143 143\n\nLuke sees the cloud race by as he takes his craft closer to \nthe planet. He must operate his controls carefully since the \ncloud cover has completely obscured his vision.  An alarm \nbuzzes in the background, Artoo beeps and whistles \nfrantically.\n\nLUKE\n(into comlink)\n\nI know, I know!  All the scopes are \ndead.  I can\u0027t see a thing!  Just \nhang on, I\u0027m going to start the \nlanding cycle...\n\nThe blast of the retrorockets is deafening, drowning out \nArtoo\u0027s electronic squeals.  Suddenly, there is a cracking \nsound as if limbs were being broken off trees and then a \ntremendous jolt as the spacecraft stops.  Luke pulls a \nswitch and his canopy pops open.\n\n50.\n\n\n\nEXT. DAGOBAH - DUSK144 144\n\nThe mist-shrouded X-wing fighter is almost invisible in the \nthick fog. Luke climbs out onto the long nose of the \nspacecraft as Artoo pops out of his cubbyhole on the back.  \nThe young warrior surveys the fog, which is barely pierced \nby the ship\u0027s landing lights.  About all he can make out are \nsome giant, twisted trees nearby.  Artoo whistles anxiously.\n\nLUKE\nNo, Artoo, you stay put.  I\u0027ll have \na look around.\n\nArtoo lets out a short beep.  As Luke moves along the nose, \nArtoo loses his balance and disappears with a splash into \nthe boggy lake.\n\nLUKE (CONT’D)\nArtoo?\n\nLuke kneels and leans over the plane looking for Artoo, but \nthe water is still and reveals no sign of the little droid.\n\nLUKE (CONT’D)\nArtoo!  Where are you?\n\nA small periscope breaks the surface of the water and a \ngurgly beep is heard.  The periscope starts to move to \nshore.  Relieved, Luke starts running along the nose of the \nfighter to its tip.\n\nLUKE (CONT’D)\nArtoo!  You be more careful.\n\nThe outline of the shore is now more than ten feet away.\n\nLuke jumps off the plane into the water, scrambles up to the \nshore, and turns to look for Artoo.  The periscope still \nsteadily moves toward shore.\n\nLUKE (CONT’D)\nArtoo - that way!\n\nSuddenly, through the thick fog layer, a dark shape appears, \nmoving toward the little droid.  The dark, sinuous bog beast \ndives beneath the swampy water, making a loud clunk against \nArtoo\u0027s metal hull.  The droid disappears from sight, \nuttering a pathetic electronic scream.\n\nHolding his ignited lightsaber before him, Luke wades a few \nfeet into the murky pool, looking for any sign of his little \nfriend.\n\n51.\n\n\n\nLUKE (CONT’D)\nArtoo!\n\nThe black surface is still as death itself... until a few \nbubbles begin to appear.  Then, phheewaat!! The runt-size \nrobot is spit out of the water, makes a graceful arc, and \ncomes crashing down into a patch of soft gray moss.\n\nLUKE (CONT’D)\nOh, no!  Are you all right?  Come \non.  You\u0027re lucky you don\u0027t taste \nvery good.  Anything broken?\n\nLuke helps Artoo to his feet and begins wiping the mud and \nroots from his round metal body.  Artoo responds with \nfeeble, soggy beeps.\n\nLUKE (CONT’D)\nIf you\u0027re saying coming here was a \nbad idea, I\u0027m beginning to agree \nwith you.  Oh, Artoo, what are we \ndoing here?  It\u0027s like... something \nout of a dream, or, I don\u0027t know. \nMaybe I\u0027m just going crazy.\n\nAs Luke glances around at the spooky swamp jungle that \nsurrounds him, Artoo ejects a stream of muddy water from one \nof his cranial ports.\n\nEXT. VADER\u0027S STAR DESTROYER - VADER\u0027S CHAMBER145 145\n\nAdmiral Piett hesitates in the entryway to Vader\u0027s private \ncubicle.\n\nAfter a moment, he steps into the room and pauses at the \nsurprising sight before him.\n\nDarth Vader, his back turned, is silhouetted in the gloom on \nthe far side of the chamber.  A black, insectlike droid \nattends him.  Among the various apparatuses surrounding \nthem, a respirator tube now retracts from Vader\u0027s uncovered \nhead.  The head is bald with a mass of ugly scar tissue \ncovering it.  The black droid then lowers the mask and \nhelmet onto Vader\u0027s head.  When it is in place, the Dark \nLord turns to face Piett.\n\nVADER\nYes, Admiral?\n\nPIETT\nOur ships have sighted the \nMillennium Falcon, lord.  But... it \nhas entered an asteroid field and \nwe cannot risk...\n\n52.\n\n\n\nVADER\n(interrupting)\n\nAsteroids do not concern me, \nAdmiral.  I want that ship and not \nexcuses.\n\nPIETT\nYes, lord.\n\nEXT. ASTEROID CAVE - MILLENNIUM FALCON146 146\n\nThe pirate starship rests in a dark, dripping asteroid cave.  \nIt is so dark that the cave\u0027s exact dimensions are \nimpossible to determine.\n\nINT. MILLENNIUM FALCON - COCKPIT147 147\n\nHan and Chewie busily shut down the engine and all \nelectronic systems. Threepio and Leia watch worriedly.\n\nHAN\nI\u0027m going to shut down everything \nbut the emergency power systems.\n\nTHREEPIO\nSir, I\u0027m almost afraid to ask, \nbut... does that include shutting \nme down, too?\n\nChewie barks \"yes\".  But Han thinks otherwise.\n\nHAN\nNo, I need you to talk to the \nFalcon, find out what\u0027s wrong with \nthe hyperdrive.\n\nSuddenly, the ship lurches, causing all the loose items in \nthe cockpit to go flying.  Chewie howls.\n\nTHREEPIO\nSir, it\u0027s quite possible this \nasteroid is not entirely stable.\n\nHAN\nNot entirely stable?  I\u0027m glad \nyou\u0027re here to tell us these \nthings.  Chewie, take the professor \nin the back and plug him into the \nhyperdrive.\n\nTHREEPIO\nOh!  Sometimes I just don\u0027t \nunderstand human behavior.  \n\n(MORE)\n\n53.\n\n\n\nAfter all, I\u0027m only trying to do my \njob in the most...\n\nThe sliding door closes behind the indignant Threepio as \nChewie and he move back to the hold.  Suddenly, the ship \nlurches again, throwing Leia across the cabin into Han\u0027s \narms.  Then, abruptly, the motion stops as suddenly as it \nstarted.  With some surprise, Han and Leia realize they are \nin each other\u0027s arms.\n\nLEIA\nLet go.\n\nHAN\nSshh!\n\nLEIA\nLet go, please.\n\nLeia flushes, averting her eyes.  She\u0027s not exactly fighting \nto get free.  But, of course, Han blows it...\n\nHAN\nDon\u0027t get excited.\n\nThe anger rises in Leia.\n\nLEIA\nCaptain, being held by you isn\u0027t \nquite enough to get me excited.\n\nHAN\nSorry, sweetheart.  We haven\u0027t got \ntime for anything else.\n\nHan grins quickly wickedly at Leia as he turns and exits \nthrough the door.  Leia\u0027s confused emotions show clearly on \nher lovely face.\n\nEXT. DAGOBAH - BOG CLEARING - DUSK148 148\n\nThe mist has dispersed a bit, but it is still a very gloomy-\nlooking swamp.\n\nLuke pulls an equipment box from the shore to the clearing.  \nHe ignites a little fusion furnace and warms his hands \nbefore it.  Taking a power cable, he plugs it into Artoo\u0027s \nnoselike socket.\n\nLUKE\nReady for some power?  Okay. Let\u0027s \nsee now.  Put that in there.  There \nyou go.\n\nTHREEPIO (CONT\u0027D)\n\n54.\n\n\n\nThe droid whistles his appreciation.  Luke then opens a \ncontainer of processed food and sits before the thermal \nheater.\n\nLUKE (CONT’D)\n(sighs)\n\nNow all I have to do is find this \nYoda... if he even exists.\n\nNervously, he looks around at the foreboding jungle.\n\nLUKE (CONT’D)\nStill... there\u0027s something familiar \nabout this place.  I feel like... I \ndon\u0027t know...\n\nSTRANGE VOICE\nFeel like what?\n\nLuke jumps out of his skin.  Artoo screeches in terror.  The \nyoung warrior grabs for his lightsaber as he spins around, \nlooking for the speaker.  Mysteriously standing right in \nfront of Luke is a strange, bluish creature, not more than \ntwo feet tall.  The wizened little thing is dressed in rags.  \nIt motions toward Luke\u0027s sword.\n\nLUKE\n(looking at the creature)\n\nLike we\u0027re being watched!\n\nCREATURE\nAway with your weapon!  I mean you \nno harm.\n\nAfter some hesitation, Luke puts away his weapon, although \nhe really doesn\u0027t understand why.  Artoo watches with \ninterest.\n\nCREATURE (CONT’D)\nI am wondering, why are you here?\n\nLUKE\nI\u0027m looking for someone.\n\nCREATURE\nLooking?  Found someone, you have, \nI would say, hmmm?\n\nThe little creature laughs.\n\nLUKE\n(Trying to keep from \nsmiling)\n\nRight.\n\n55.\n\n\n\nCREATURE\nHelp you I can.  Yes, mmmm.\n\nLUKE\nI don\u0027t think so.  I\u0027m looking for \na great warrior.\n\nCREATURE\nAhhh!  A great warrior.\n\n(laughs and shakes his \nhead)\n\nWars not make one great.\n\nWith the aid of a walking stick, the tiny stranger moves \nover to one of the cases of supplies.  He begins to rummage \naround.\n\nArtoo moves to the edge of the case - standing almost eye \nlevel to the creature who is carelessly handling the \nsupplies - and squeaks his disapproval.\n\nTheir tiny visitor pick up the container of food Luke was \neating from and takes a bite.\n\nLUKE\nPut that down.  Hey!  That\u0027s my \ndinner!\n\nThe creature spits out the bite he has taken.  He makes a \nface.\n\nCREATURE\nHow you get so big, eating food of \nthis kind?\n\nHe flips the container in Luke\u0027s direction and reaches into \none of Luke\u0027s supply cases.\n\nLUKE\nListen, friend, we didn\u0027t mean to \nland in that puddle, and if we \ncould get our ship out, we would, \nbut we can\u0027t, so why don\u0027t you \njust...\n\nCREATURE\n(teasing)\n\nAww, cannot get your ship out?\n\nThe creature spots something of interest in Luke\u0027s case.  \nLuke loses patience and grabs the case away.  The creature \nretains his prize - a tiny power lamp - and examines it with \ndelight.\n\n56.\n\n\n\nLUKE\nHey, you could have broken this. \nDon\u0027t do that.  Ohhh... you\u0027re \nmaking a mess.  Hey, give me that!\n\nCREATURE\n(retreating with the \nlamp)\n\nMine!  Or I will help you not.\n\nClutching its treasure, the creature backs away from Luke, \ndrawing closer to Artoo.  As Luke and the creature argue, \none of Artoo\u0027s little arms slowly moves out toward the power \nlamp, completely unnoticed by the creature.\n\nLUKE\nI don\u0027t want your help.  I want my \nlamp back.  I\u0027ll need it to get out \nof this slimy mudhole.\n\nCREATURE\nMudhole?  Slimy?  My home this is.\n\nArtoo grabs hold of the lamp and the two little figures are \nimmediately engaged in a tug-of-war over it.\n\nArtoo beeps a few angry, \"Give me thats.\"\n\nCREATURE (CONT’D)\nAh, ah, ah!\n\nLUKE\nOh, Artoo, let him have it!\n\nCREATURE\nMine!  Mine!\n\nLUKE\nArtoo!\n\nCREATURE\nMine!\n\nThe creature lets go with one hand and pokes Artoo lightly \nwith one finger.  Artoo reacts with a startled squeal, and \nlets go.\n\nCREATURE (CONT’D)\nMine!\n\n57.\n\n\n\nLUKE\n(fed up)\n\nNow will you move along, little \nfella?  We\u0027re got a lot of work to \ndo.\n\nCREATURE\nNo!  No, no!  Stay and help you, I \nwill.\n\n(laughs)\nFind your friend, hmm?\n\nLUKE\nI\u0027m not looking for a friend. I\u0027m \nlooking for a Jedi Master.\n\nCREATURE\nOohhh.  Jedi Master.  Yoda.  You \nseek Yoda.\n\nLUKE\nYou know him?\n\nCREATURE\nMmm.  Take you to him, I will.\n\n(laughs)\nYes, yes.  But now, we must eat. \nCome.  Good food.  Come.\n\nWith that, the creature scurries out of the clearing, \nlaughing merrily. Luke stares after him.  All he sees is the \nfaint light from the small power lamp moving through the \nfog.  Luke makes his decision and starts after the creature.\n\nCREATURE (CONT’D)\n(in the distance)\n\nCome, come.\n\nArtoo, very upset, whistles a blue streak of protest.\n\nLUKE\nStay here and watch after the camp, \nArtoo.\n\nArtoo beeps even more frantically.  But as Luke disappears \nfrom view, the worried little droid grows quieter, and \nutters a soft electronic sigh.\n\nINT. MILLENNIUM FALCON - MAIN HOLD AREA149 149\n\nThreepio whistles and beeps a strange dialect into the \ncontrol panel in front of him.  The control panel whistles \nback a few mystifying beeps.\n\n58.\n\n\n\nTHREEPIO\nOh, where is Artoo when I need him?\n\nHan enters the hold area and kneels on the floor near the \ncontrol box.\n\nTHREEPIO (CONT’D)\nSir, I don\u0027t know where your ship \nlearned to communicate, but it has \nthe most peculiar dialect.  I \nbelieve, sir, it says that the \npower coupling on the negative axis \nhas been polarized.  I\u0027m afraid \nyou\u0027ll have to replace it.\n\nHAN\nWell, of course I\u0027ll have to \nreplace it.\n\nHe hands a wire coil up to Chewie who is working near the \nceiling.\n\nHAN (CONT’D)\nHere!  And Chewie...\n\nChewie brings his head back through the trap door in the \nceiling and whines.  Han glances back at Threepio, then \nspeaks quietly to Chewie so only he can hear.\n\nHAN (CONT’D)\n(continuing)\n\n... I think we\u0027d better replace the \nnegative power coupling.\n\nLeia finishes welding the valves she has been working on and \nattempts to reengage the system by pulling a lever attached \nto the valve.  It doesn\u0027t budge.  Han notices her struggle, \nand moves to help her.  She rebuffs him.\n\nHAN (CONT’D)\nHey, Your Worship, I\u0027m only trying \nto help.\n\nLEIA\n(still struggling)\n\nWould you please stop calling me \nthat?\n\nHan hears a new tone in her voice.  He watches her pull on \nthe lever.\n\nHAN\nSure, Leia.\n\n59.\n\n\n\nLEIA\nOh, you make it so difficult \nsometimes.\n\nHAN\nI do, I really do.  You could be a \nlittle nicer, though.\n\n(he watches her reaction)\nCome on, admit it.  Sometimes you \nthink I\u0027m all right.\n\nShe lets go of the lever and rubs her sore hand.\n\nLEIA\nOccasionally...\n\n(a little smile, \nhaltingly)\n\n... when you aren\u0027t acting like a \nscoundrel.\n\nHAN\n(laughs)\n\nScoundrel?  Scoundrel?  I like the \nsound of that.\n\nWith that, Han takes her hand and starts to massage it.\n\nLEIA\nStop that.\n\nHAN\nStop what?\n\nLeia is flushes, confused.\n\nLEIA\nStop that!  My hands are dirty.\n\nHAN\nMy hands are dirty, too.  What are \nyou afraid of?\n\nLEIA\n(looking right into his \neyes)\n\nAfraid?\n\nHan looks at her with a piercing look.  He\u0027s never looked \nmore handsome, more dashing, more confident.  He reaches out \nslowly and takes Leia\u0027s hand again from where it is resting \non a console.  He draws it toward him.\n\nHAN\nYou\u0027re trembling.\n\n60.\n\n\n\nLEIA\nI\u0027m not trembling.\n\nThen with an irresistible combination of physical strength \nand emotional power, the space pirate begins to draw Leia \ntoward him... very slowly.\n\nHAN\nYou like me because I\u0027m a \nscoundrel. There aren\u0027t enough \nscoundrels in your life.\n\nLeia is now very close to Han and as she speaks, her voice \nbecomes an excited whisper, a tone completely in opposition \nto her words.\n\nLEIA\nI happen to like nice men.\n\nHAN\nI\u0027m a nice man.\n\nLEIA\nNo, you\u0027re not.  You\u0027re...\n\nHe kisses her now, with slow, hot lips.  He takes his time, \nas though he had forever, bending her body backward.  She \nhas never been kissed like this before, and it almost makes \nher faint.  When he stops, she regains her breath and tries \nto work up some indignation, but finds it hard to talk.\n\nSuddenly, Threepio appears in the doorway, speaking \nexcitedly.\n\nTHREEPIO\nSir, sir!  I\u0027ve isolated the \nreverse power flux coupling.\n\nHan turns slowly, icily, from their embrace.\n\nHAN\nThank you.  Thank you very much.\n\nTHREEPIO\nOh, you\u0027re perfectly welcome, sir.\n\nThe moment spoiled, Han marches out after Threepio.\n\nEXT. SPACE - ASTEROID FIELD150 150\n\nThe Imperial fleet moves through the asteroid-filled void, \nintently seeking its prey.\n\n61.\n\n\n\nINT. VADER\u0027S STAR DESTROYER - BRIDGE151 151\n\nAsteroids collide, creating a fireworks display outside the \nbridge window.  Darth Vader stands, staring out the window \nabove the control deck.  Then slowly turns toward the \nbridge.  Before him are the hologram images of twenty \nbattleship commanders.  One of these images, the commander \nof a ship that has just exploded, is fading away quickly. \nAnother image, in the center and a little apart from the \nothers, is faded and continually disrupted by static.  It is \nthe image of Captain Needa, commander of the Star Destroyer \nmost hotly on the tail of the Millennium Falcon.  Admiral \nPiett and an aide stand behind the Dark Lord.\n\nNEEDA\n(in hologram)\n\n... and that, Lord Vader, was the \nlast time they appeared in any of \nour scopes.  Considering the amount \nof damage we\u0027ve sustained, they \nmust have been destroyed.\n\nVADER\nNo, Captain, they\u0027re alive.  I want \nevery ship available to sweep the \nasteroid field until they are \nfound.\n\nThe Imperial star captains fade out one by one as Vader \nturns to Admiral Piett.\n\nPIETT\nLord Vader.\n\nVADER\nYes, Admiral, what is it?\n\nThe admiral is scared, his face white as a sheet.\n\nPIETT\nThe Emperor commands you make \ncontact with him.\n\nVADER\nMove the ship out of the asteroid \nfield so that we can send a clear \ntransmission.\n\nPIETT\nYes, my lord.\n\n62.\n\n\n\nEXT. ASTEROID FIELD - VADER\u0027S STAR DESTROYER152 152\n\nVader\u0027s Imperial Star Destroyer moves against the vast sea \nof stars away from the rest of the fleet.\n\nINT. VADER\u0027S STAR DESTROYER - VADER\u0027S CHAMBER153 153\n\nThe Dark Lord, Darth Vader, is alone in his chamber.  A \nstrange sound enters the room and a light begins to play \nacross Vader\u0027s black figure. He looks up and bows quickly.\n\nA twelve-foot hologram of the Galactic Emperor materializes \nbefore Vader.  The Emperor\u0027s dark robes and monk\u0027s hood are \nreminiscent of the cloak worn by Ben Kenobi.  His voice is \neven deeper and more frightening than Vader\u0027s.\n\nVADER\nWhat is thy bidding, my master?\n\nEMPEROR\nThere is a great disturbance in the \nForce.\n\nVADER\nI have felt it.\n\nEMPEROR\nWe have a new enemy - Luke \nSkywalker.\n\nVADER\nYes, my master.\n\nEMPEROR\nHe could destroy us.\n\nVADER\nHe\u0027s just a boy.  Obi-Wan can no \nlonger help him.\n\nEMPEROR\nThe Force is strong with him.  The \nson of Skywalker must not become a \nJedi.\n\nVADER\nIf he could be turned, he would \nbecome a powerful ally.\n\nEMPEROR\nYes.  Yes.  He would be a great \nasset.  Can it be done?\n\n63.\n\n\n\nVADER\nHe will join us or die, my master.\n\nVader kneels.  The supreme Emperor passes a hand over the \ncrouched Lord of the Sith and fades away.\n\nEXT. DAGOBAH - CREATURE\u0027S HOUSE - NIGHT154 154\n\nA heavy downpour of rain pounds through the gnarled trees.  \nA strange baroque mud house sits on a moss-covered knoll on \nthe edge of a small lagoon.  The small, gnomish structure \nradiates a warm glow from its thick glass windows.  As rain \ntap-dances a merry tune on Artoo\u0027s head, the stubby little \ndroid rises up on his tip-toes to peek into one of the \nglowing portals.\n\nINT. CREATURE\u0027S HOUSE155 155\n\nArtoo, peeking in the window, sees the inside of the house - \na very plain, but cozy dwelling.  Everything is in the same \nsmall scale as the creature.  The only thing out of place in \nthe miniature room is Luke, whose height makes the four-foot \nceiling seem even lower.  He sits cross-legged on the floor \nof the living room.\n\nThe creature is in an adjoining area - his little kitchen - \ncooking up an incredible meal.  The stove is a steaming \nhodgepodge of pots and pans.  The wizened little host \nscurries about chopping this, shredding that, and showering \neverything with exotic herbs and spices.  He rushes back and \nforth putting platters on the table in front of Luke, who \nwatches the creature impatiently.\n\nLUKE\nLook, I\u0027m sure it\u0027s delicious. I \njust don\u0027t understand why we can\u0027t \nsee Yoda now.\n\nCREATURE\nPatience!  For the Jedi it is time \nto eat as well.  Eat, eat. Hot.  \nGood food, hm? Good, hmm?\n\nMoving with some difficulty in the cramped quarters, Luke \nsits down near the fire and serves himself from the pot.  \nTasting the unfamiliar concoction, he is pleasantly \nsurprised.\n\nLUKE\nHow far away is Yoda?  Will it take \nus long to get there?\n\n64.\n\n\n\nCREATURE\nNot far.  Yoda not far.  Patience. \nSoon you will be with him.\n\n(tasting food from the \npot)\n\nRootleaf, I cook.  Why wish you \nbecome Jedi?  Hm?\n\nLUKE\nMostly because of my father, I \nguess.\n\nCREATURE\nAh, your father.  Powerful Jedi was \nhe, powerful Jedi, mmm.\n\nLUKE\n(a little angry)\n\nOh, come on.  How could you know my \nfather?  You don\u0027t even know who I \nam.\n\n(fed up)\nOh, I don\u0027t know what I\u0027m doing \nhere.  We\u0027re wasting our time.\n\nThe creature turns away from Luke and speaks to a third \nparty.\n\nCREATURE\n(irritated)\n\nI cannot teach him.  The boy has no \npatience.\n\nLuke\u0027s head spins in the direction the creature faces.  But \nthere is no one there.  The boy is bewildered, but it \ngradually dawns on him that the little creature is Yoda, the \nJedi Master, and that he is speaking with Ben.\n\nBEN\u0027S VOICE\nHe will learn patience.\n\nYODA\nHmmm.  Much anger in him, like his \nfather.\n\nBEN\u0027S VOICE\nWas I any different when you taught \nme?\n\nYODA\nHah.  He is not ready.\n\n65.\n\n\n\nLUKE\nYoda!  I am ready.  I... Ben!  I \ncan be a Jedi.  Ben, tell him I\u0027m \nready.\n\nTrying to see Ben, Luke starts to get up but hits his head \non the low ceiling.\n\nYODA\nReady, are you?  What know you of \nready?  For eight hundred years \nhave I trained Jedi.  My own \ncounsel will I keep on who is to be \ntrained! A Jedi must have the \ndeepest commitment, the most \nserious mind.\n\n(to the invisible Ben, \nindicating Luke)\n\nThis one a long time have I \nwatched. All his life has he looked \naway... to the future, to the \nhorizon. Never his mind on where he \nwas. Hmm?  What he was doing.  \nHmph. Adventure.  Heh!  Excitement.  \nHeh! A Jedi craves not these \nthings.\n\n(turning to Luke)\nYou are reckless!\n\nLuke looks down.  He knows it is true.\n\nBEN\u0027S VOICE\nSo was I, if you\u0027ll remember.\n\nYODA\nHe is too old.  Yes, too old to \nbegin the training.\n\nLuke thinks he detects a subtle softening in Yoda\u0027s voice.\n\nLUKE\nBut I\u0027ve learned so much.\n\nYoda turns his piercing gaze on Luke, as though the Jedi \nMaster\u0027s huge eyes could somehow determine how much the boy \nhad learned.  After a long moment, the little Jedi turns \ntoward where he alone sees Ben.\n\nYODA\n(sighs)\n\nWill he finished what he begins?\n\nLUKE\nI won\u0027t fail you - I\u0027m not afraid.\n\n66.\n\n\n\nYODA\n(turns slowly toward him)\n\nOh, you will be.  You will be.\n\nEXT. SPACE - STAR DESTROYERS - ASTEROID FIELD156 156\n\nThe Imperial fleet around Vader\u0027s ship is surrounded by the \nasteroid storm.  Asteroids big and small pelt the vast \nexteriors of the menacing ships.  One of the smaller \nImperial vessels is hit by a huge asteroid and explodes in a \nbrilliant flash of light.\n\nINT. ASTEROID CAVE - MILLENNIUM FALCON - COCKPIT157 157\n\nThe cockpit is quiet and lit only by the indicator lights on \nthe control panel.  Princess Leia sits in the pilot\u0027s seat.\n\nShe runs her hand across the control panel as she thinks of \nHan and the confusion he has created within her.  Suddenly, \nsomething outside the cockpit window catches her eye.  The \nreflection of the panel lights obscures her vision until a \nsoft suctionlike cup attaches itself to the windscreen.  \nLeia moves closer to see what it might be.  Large, yellow \neyes flash open and stare back at her.  Startled, she jumps \nback into her seat, her heart pounding.  There is a scurry \nof feet and a loud screech, and in an instant the eyes are \ngone.  The young princess catches her breath, jumps out of \nher chair, and races from the cockpit.\n\nINT. ASTEROID CAVE - MILLENNIUM FALCON - HOLD AREA158 158\n\nThe lights go bright for a second then out again.  Threepio \nand Chewbacca watch as Han finishes with some wires.\n\nTHREEPIO\nSir, if I may venture an opinion...\n\nHAN\nI\u0027m not really interested in your \nopinion, Threepio.\n\nLeia rushes into the cabin just as Han drops the final floor \npanel into place.\n\nLEIA\n(out of breath)\n\nThere\u0027s something out there.\n\nHAN\nWhere?\n\nLEIA\nOutside, in the cave.\n\n67.\n\n\n\nAs she speaks, there comes a sharp banging on the hull.  \nChewie looks up and barks anxiously.\n\nTHREEPIO\nThere it is.  Listen!  Listen!\n\nHAN\nI\u0027m going out there.\n\nLEIA\nAre you crazy?!\n\nHAN\nI just got this bucket back \ntogether.  I\u0027m not going to let \nsomething tear it apart.\n\nHe and Chewie grab their breath masks off a rack and hurry \nout.  Leia follows.\n\nLEIA\nThen I\u0027m going with you.\n\nTHREEPIO\nI think it might be better if I \nstay here and guard the ship.\n\n(hears another mysterious \nnoise)\n\nOh, no.\n\nEXT. ASTEROID CAVE - MILLENNIUM FALCON159 159\n\nIt is very dark inside the huge asteroid cave, too dark to \nsee what is attacking the ship.\n\nLeia stamps her foot on the floor of the cave.\n\nLEIA\nThis ground sure feels strange. It \ndoesn\u0027t feel like rock at all.\n\nHan kneels and studies the ground, then attempts to study \nthe outline of the cave.\n\nHAN\nThere\u0027s an awful lot of moisture in \nhere.\n\nLEIA\nI don\u0027t know.  I have a bad feeling \nabout this.\n\nHAN\nYeah.\n\n68.\n\n\n\nChewie barks through his face mask, and points toward the \nship\u0027s cockpit.  A five-foot-long shape can be seen moving \nacross the top of the Falcon.  The leathery creature lets \nout a screech as Han blasts it with a laser bolt.\n\nHAN (CONT’D)\n(to Leia)\n\nWatch out!\n\nThe black shape tumbles off the spaceship and onto the \nground in front of the princess.  Han bends down to \ninvestigate the dead creature.\n\nHAN (CONT’D)\nYeah, that\u0027s what I thought. \nMynock.  Chewie, check the rest of \nthe ship, make sure there aren\u0027t \nany more attached.  They\u0027re chewing \non the power cables.\n\nLEIA\nMynocks?\n\nHAN\nGo on inside.  We\u0027ll clean them off \nif there are any more.\n\nJust then, a swarm of the ugly creatures swoops through the \nair.  Leia puts her arms over her head to protect herself as \nshe runs toward the ship.  Chewie shoos another Mynock away \nwith his blaster.  Several of the batlike creatures flap \ntheir wings loudly against the cockpit window of the Falcon.  \nInside, Threepio shudders at their presence.\n\nTHREEPIO\nOhhh!  Go away!  Go away!  Beastly \nlittle thing.  Shoo!  Shoo!\n\nHan looks around the strange, dripping cave.\n\nHAN\nWait a minute...\n\nHe unholsters his blaster and fires at the far side of the \nhuge cave. The cavern begins to shake and the ground starts \nto buckle.\n\nChewie barks and moves for the ship, followed closely by \nLeia and Han. The large wings of the Mynocks flap past them \nas they protect their faces and run up the platform.\n\n69.\n\n\n\nINT. ASTEROID CAVE - MILLENNIUM FALCON - ENTRY AREA160 160\n\nAs soon as Han and Leia are on board, Chewie closes the main \nhatch. The ship continues to shake and heave.\n\nHAN\nAll right, Chewie, let\u0027s get out of \nhere!\n\nThe Wookiee heads for the cockpit as Han, followed by \nThreepio, rushes to the hold area and checks the scopes on \nthe control panel.  Leia hurries after.\n\nLEIA\nThe Empire is still out there. I \ndon\u0027t think it\u0027s wise to...\n\nHan rushes past her and heads for the cockpit.\n\nHAN\n(interrupting)\n\nNo time to discuss this in \ncommittee.\n\nAnd with that he is gone.  The main engines of the Falcon \nbegin to whine.  Leia races after him, bouncing around in \nthe shaking ship.\n\nLEIA\n(angry)\n\nI am not a committee!\n\nINT. ASTEROID CAVE - MILLENNIUM FALCON - COCKPIT161 161\n\nHan is already in the pilot\u0027s seat pulling back on the \nthrottle.  The cave-quake has greatly diminished.\n\nLEIA\nYou can\u0027t make the jump to light- \nspeed in this asteroid field...\n\nHAN\nSit down, sweetheart.  We\u0027re taking \noff!\n\nAs the ship begins to move forward, Chewie barks.  He \nnotices something out the window ahead.  Threepio sees it \ntoo.\n\nTHREEPIO\nLook!\n\nHAN\nI see it, I see it.\n\n70.\n\n\n\nSuddenly, a row of jagged white stalagmites and stalactites \ncan be seen surrounding the entrance.  And as the Falcon \nmoves forward, the entrance to the cave grows ever smaller.  \nHan pulls hard on the throttle, sending his ship surging \nforward.\n\nTHREEPIO\nWe\u0027re doomed!\n\nLEIA\nThe cave is collapsing.\n\nHAN\nThis is no cave.\n\nLEIA\nWhat?\n\nLeia\u0027s mouth drops open .  She sees that the rocks of the \ncave entrance are not rocks at all, but giant teeth, quickly \nclosing around the tiny ship.  Chewie howls.\n\nINT. SPACE SLUG MOUTH162 162\n\nThe Millennium Falcon, zooming through the monster\u0027s mouth, \nrolls on its side and barely makes it between two of the \ngigantic white teeth before the huge jaws slams closed.\n\nEXT. CAVE ENTRANCE - GIANT ASTEROID163 163\n\nThe enormous space slug moves its head out of the cave as \nthe Falcon flies out of its mouth.  The monster tilts its \nhead, watching the starship fly away.\n\nEXT. MILLENNIUM FALCON - GIANT ASTEROID164 164\n\nThe Falcon races out of the asteroid crater and into the \ndeadly rain of the asteroid storm.\n\nEXT. DAGOBAH - DAY165 165\n\nWith Yoda strapped to his back, Luke climbs up one of the \nmany thick vines that grow in the swamp.  Panting heavily, \nhe continues his course - climbing, flipping through the \nair, jumping over roots, and racing in and out of the heavy \nground fog.\n\nYODA\nRun!  Yes.  A Jedi\u0027s strength flows \nfrom the Force.  But beware of the \ndark side.  Anger... fear... \naggression.  The dark side of the \nForce are they. Easily they flow, \nquick to join you in a fight.  \n\n(MORE)\n\n71.\n\n\n\nIf once you start down the dark \npath, forever will it dominate your \ndestiny, consume you it will, as it \ndid Obi-Wan\u0027s apprentice.\n\nLUKE\nVader.  Is the dark side stronger?\n\nYODA\nNo... no... no.  Quicker, easier, \nmore seductive.\n\nLUKE\nBut how am I to know the good side \nfrom the bad?\n\nYODA\nYou will know.  When you are calm, \nat peace.  Passive.  A Jedi uses \nthe Force for knowledge and \ndefense, never for attack.\n\nLUKE\nBut tell me why I can\u0027t...\n\nYODA\n(interrupting)\n\nNo, no, there is no why.  Nothing \nmore will I teach you today. Clear \nyour mind of questions. Mmm.  \nMmmmmmmm.\n\nArtoo beeps in the distance as Luke lets Yoda down to the \nground. Breathing heavily, he takes his shirt from a nearby \ntree branch and pulls it on.\n\nHe turns to see a huge, dead, black tree, its base \nsurrounded by a few feet of water.  Giant, twisted roots \nform a dark and sinister cave on one side.  Luke stares at \nthe tree, trembling.\n\nLUKE\nThere\u0027s something not right here.\n\nYoda sits on a large root, poking his Gimer Stick into the \ndirt.\n\nLUKE (CONT’D)\nI feel cold, death.\n\nYODA\nThat place... is strong with the \ndark side of the Force.  A domain \nof evil it is.  In you must go.\n\nYODA (CONT\u0027D)\n\n72.\n\n\n\nLUKE\nWhat\u0027s in there?\n\nYODA\nOnly what you take with you.\n\nLuke looks warily between the tree and Yoda.  He starts to \nstrap on his weapon belt.\n\nYODA (CONT’D)\nYour weapons... you will not need \nthem.\n\nLuke gives the tree a long look, than shakes his head \"no.\"  \nYoda shrugs.  Luke reaches up to brush aside some hanging \nvines and enters the tree.\n\nINT. DAGOBAH - TREE CAVE166 166\n\nLuke moves into the almost total darkness of the wet and \nslimy cave. The youth can barely make out the edge of the \npassage.  Holding his lit saber before him, he sees a lizard \ncrawling up the side of the cave and a snake wrapped around \nthe branches of a tree.  Luke draws a deep breath, then \npushes deeper into the cave.\n\nThe space widens around him, but he feels that rather than \nsees it. His sword casts the only light as he peers into the \ndarkness.  It is very quiet here.\n\nThen, a loud HISS! Darth Vader appears across the blackness, \nilluminated by his own just-ignited laser sword.  \nImmediately, he charges Luke, saber held high.  He is upon \nthe youth in seconds, but Luke sidesteps perfectly and \nslashes at Vader with his sword.\n\nVader is decapitated.  His helmet-encased head flies from \nhis shoulders as his body disappears into the darkness.  The \nmetallic banging of the helmet fills the cave as Vader\u0027s \nhead spins and bounces, smashes on the floor, and finally \nstops. For an instant it rests on the floor, then it cracks \nvertically.  The black helmet and breath mask fall away to \nreveal... Luke\u0027s head.\n\nAcross the space, the standing Luke gasps at the sight, wide-\neyed in terror.\n\nThe decapitated head fades away, as in a vision.\n\nEXT. DAGOBAH - CAVE - DUSK167 167\n\nMeanwhile, Yoda sits on the root, calmly leaning on his \nGimer Stick.\n\n73.\n\n\n\nEXT. SPACE - VADER\u0027S STAR DESTROYER168 168\n\nVader\u0027s Imperial Star Destroyer moves through space, guarded \nby its convoy of TIE fighters.\n\nINT. VADER\u0027S STAR DESTROYER - BRIDGE - CONTROL DECK169 169\n\nVader stands in the back control area of his ship\u0027s bridge \nwith a motley group of men and creatures.  Admiral Piett and \ntwo controllers stand at the front of the bridge and watch \nthe group with scorn.\n\nPIETT\nBounty hunters.  We don\u0027t need that \nscum.\n\nFIRST CONTROLLER\nYes, sir.\n\nPIETT\nThose Rebels won\u0027t escape us.\n\nA second controller interrupts.\n\nSECOND CONTROLLER\nSir, we have a priority signal from \nthe Star Destroyer Avenger.\n\nPIETT\nRight.\n\nThe group standing before Vader is a bizarre array of \ngalactic fortune hunters  There is Bossk, a slimy, tentacled \nmonster with two huge, bloodshot eyes in a soft baggy face; \nZuckuss and Dengar, two battle- scarred, mangy human types; \nIG-88, a battered, tarnished chrome war droid; and Boba \nFett, a man in a weapon-covered armored space suit.\n\nVADER\n... there will be a substantial \nreward for the one who finds the \nMillennium Falcon.  You are free to \nuse any methods necessary, but I \nwant them alive.  No \ndisintegrations.\n\nBOBA FETT\nAs you wish.\n\nAt that moment, Admiral Piett approaches Vader in a rush of \nexcitement.\n\nPIETT\nLord Vader!  My lord, we have them.\n\n74.\n\n\n\nEXT. IMPERIAL STAR DESTROYER, AVENGER - ASTEROID BELT170 170\n\nThe Millennium Falcon speeds through deep space, closely \nfollowed by a firing Imperial Star Destroyer.  A large \nasteroid about the same size as the Falcon tumbles rapidly \ntoward the starship.  The tiny Falcon banks to avoid the \ngiant asteroid as smaller rocks pelt its surface. Then the \nsmall craft roars under the asteroid which explodes \nharmlessly on the hull of the vast Star Destroyer.\n\nINT. MILLENNIUM FALCON - COCKPIT171 171\n\nThe ship shudders as flak explodes near the cockpit window.  \nThreepio checks a tracking scope an the side control panel \nwhile Leia watches tensely out the window.\n\nTHREEPIO\nOh, thank goodness we\u0027re coming out \nof the asteroid field.\n\nChewie barks excitedly as the rain of asteroids begins to \nsubside.  A bolt from the Star Destroyer sets up a fiery \nexplosion on the back side of the Falcon, causing it to \nlurch to one side.\n\nEXT. MILLENNIUM FALCON - STAR DESTROYER, AVENGER - ASTEROID 172 172\nFIELD\n\nThe Falcon is hit hard by another bolt from the Star \nDestroyer which creates a huge explosion near the cockpit of \nthe smaller ship.  The Falcon tilts steeply, then rights \nitself.\n\nINT. MILLENNIUM FALCON - COCKPIT173 173\n\nHan corrects the angle of his ship.\n\nHAN\nLet\u0027s get out of here.  Ready for \nlight-speed?  One... two... three!\n\nHan pulls back on the hyperspace throttle and - nothing \nhappens.  Flak bursts continue to rock the ship.\n\nHAN (CONT’D)\n(frantic)\n\nIt\u0027s not fair!\n\nChewie is very angry and starts to growl and bark at his \nfriend and captain.  Again, Han desperately pulls back on \nthe throttle.\n\n75.\n\n\n\nHAN (CONT’D)\nThe transfer circuits are working. \nIt\u0027s not my fault!\n\nChewie puts his head in his hands, whining.\n\nLEIA\n(almost expecting it)\n\nNo light-speed?\n\nHAN\nIt\u0027s not my fault.\n\nTHREEPIO\nSir, we just lost the main rear \ndeflector shield.  One more direct \nhit on the back quarter and we\u0027re \ndone for.\n\nHan pauses for a moment, makes a decision, and pulls back on \na lever.\n\nHAN\nTurn her around.\n\nChewie barks in puzzlement.\n\nHAN (CONT’D)\nI said turn her around!  I\u0027m going \nto put all power in the front \nshield.\n\nLEIA\nYou\u0027re going to attack them?!\n\nTHREEPIO\nSir, the odds of surviving a direct \nassault on an Imperial Star \nDestroyer...\n\nLEIA\nShut up!\n\nEXT. SPACE - MILLENNIUM FALCON - ASTEROID FIELD174 174\n\nThe Falcon banks, makes a steep, twisting turn.  In the next \nmoment it is racing toward the Star Destroyer, looking very \nsmall against the massive surface of the Imperial ship.  As \nit moves across the surface of the Star Destroyer, the \nFalcon bobs and weaves to avoid the numerous flak bursts.\n\n76.\n\n\n\nINT. STAR DESTROYER, AVENGER - BRIDGE175 175\n\nThe tiny Falcon heads directly for the Avenger\u0027s bridge.  \nThe Imperials stationed there are stunned to see the small \nspaceship racing low across the hull, headed directly at the \nhuge windows of the bridge area.  Alarms go off everywhere.  \nThe Destroyer\u0027s commander, Captain Needa, can scarcely \nbelieve his eyes.\n\nNEEDA\nThey\u0027re moving to attack position!  \nShields up!\n\nNeeda and his men duck as the Falcon nears the bridge \nwindow.  At the last minute, the Falcon veers off and out of \nsight.  All is quiet.\n\nNEEDA (CONT’D)\nTrack them.  They may come around \nfor another pass.\n\nTRACKING OFFICER\nCaptain Needa, the ship no longer \nappears on our scopes.\n\nNEEDA\nThey can\u0027t have disappeared.  No \nship that small has a cloaking \ndevice.\n\nTRACKING OFFICER\nWell, there\u0027s no trace of them, \nsir.\n\nCOMMUNICATIONS OFFICER\nCaptain, Lord Vader demands an \nupdate on the pursuit.\n\nNEEDA\n(drawing a breath)\n\nGet a shuttle ready.  I shall \nassume full responsibility for \nlosing them, and apologize to Lord \nVader. Meanwhile, continue to scan \nthe area.\n\nCOMMUNICATIONS OFFICER\nYes, Captain Needa.\n\nEXT. DAGOBAH - BOG - DAY176 176\n\nLuke\u0027s face is upside-down and showing enormous strain.  He \nstands on his hands, with Yoda perched on his feet.  \n\n77.\n\n\n\nOpposite Luke and Yoda are two rocks the size of bowling \nballs.  Luke stares at the rocks and concentrates.  One of \nthe rocks lifts from the ground and floats up to rest on the \nother.\n\nYODA\nUse the Force.  Yes...\n\nYoda taps Luke\u0027s leg.  Quickly, Luke lifts one hand from the \nground. His body wavers, but he maintains his balance.  \nArtoo, standing nearby, is whistling and beeping \nfrantically.\n\nYODA (CONT’D)\nNow... the stone.  Feel it.\n\nLuke concentrates on trying to lift the top rock.  It rises \na few feet, shaking under the strain.  But, distracted by \nArtoo\u0027s frantic beeping, Luke loses his balance and finally \ncollapses.  Yoda jumps clear.\n\nYODA (CONT’D)\nConcentrate!\n\nAnnoyed at the disturbance, Luke looks over at Artoo, who is \nrocking urgently back and forth in front of him.\n\nArtoo waddles closer to Luke, chirping wildly, then scoots \nover the edge of the swamp.  Catching on, Luke rushes to the \nwater\u0027s edge.  The X-wing fighter has sunk, and only the tip \nof its nose shows above the lake\u0027s surface.\n\nLUKE\nOh, no.  We\u0027ll never get it out \nnow.\n\nYoda stamps his foot in irritation.\n\nYODA\nSo certain are you.  Always with \nyou it cannot be done.  Hear you \nnothing that I say?\n\nLuke looks uncertainly out at the ship.\n\nLUKE\nMaster, moving stones around is one \nthing.  This is totally different.\n\nYODA\nNo!  No different!  Only different \nin your mind.  You must unlearn \nwhat you have learned.\n\n78.\n\n\n\nLUKE\n(focusing, quietly)\n\nAll right, I\u0027ll give it a try.\n\nYODA\nNo!  Try not.  Do.  Or do not. \nThere is no try.\n\nLuke closes his eyes and concentrates on thinking the ship \nout.\n\nSlowly, the X-wing\u0027s nose begins to rise above the water.  \nIt hovers for a moment and then slides back, disappearing \nonce again.\n\nLUKE\n(panting heavily)\n\nI can\u0027t.  It\u0027s too big.\n\nYODA\nSize matters not.  Look at me. \nJudge me by my size, do you? Hm?  \nMmmm.\n\nLuke shakes his head.\n\nYODA (CONT’D)\nAnd well you should not.  For my \nally in the Force.  And a powerful \nally it is.  Life creates it, makes \nit grow.  Its energy surrounds us \nand binds us.  Luminous beings are \nwe...\n\n(Yoda pinches Luke\u0027s \nshoulder)\n\n... not this crude matter.\n(a sweeping gesture)\n\nYou must feel the Force around you.\n(gesturing)\n\nHere, between you... me... the \ntree... the rock... everywhere! \nYes, even between this land and \nthat ship!\n\nLUKE\n(discouraged)\n\nYou want the impossible.\n\nQuietly Yoda turns toward the X-wing fighter.  With his eyes \nclosed and his head bowed, he raises his arm and points at \nthe ship.\n\nSoon, the fighter rises above the water and moves forward as \nArtoo beeps in terror and scoots away.\n\n79.\n\n\n\nThe entire X-wing moves majestically, surely, toward the \nshore.  Yoda stands on a tree root and guides the fighter \ncarefully down toward the beach.\n\nLuke stares in astonishment as the fighter settles down onto \nthe shore. He walks toward Yoda.\n\nLUKE (CONT’D)\nI don\u0027t... I don\u0027t believe it.\n\nYODA\nThat is why you fail.\n\nLuke shakes his head, bewildered.\n\nEXT. SPACE - IMPERIAL FLEET177 177\n\nThe fleet around Vader\u0027s Star Destroyer now includes Needa\u0027s \nStar Destroyer, the Avenger.\n\nINT. VADER\u0027S STAR DESTROYER - BRIDGE178 178\n\nVADER\nApology accepted, Captain Needa.\n\nClutching desperately at his throat, Captain Needa slumps \ndown, then falls over on his back, at the feet of Darth \nVader.  Two stormtroopers pick up the lifeless body and \ncarry it quickly away as Admiral Piett and two of his \ncaptains hurry up to the Dark Lord.\n\nPIETT\nLord Vader, our ships have \ncompleted their scan of the area \nand found nothing.  If the \nMillennium Falcon went into light- \nspeed, it\u0027ll be on the other side \nof the galaxy by now.\n\nVADER\nAlert all commands.  Calculate \nevery possible destination along \ntheir last know trajectory.\n\nPIETT\nYes, my lord.  We\u0027ll find them.\n\nVADER\nDon\u0027t fail me again, Admiral.\n\nVader exits as the admiral turns to an aide, a little more \nuneasy than when he arrived.\n\n80.\n\n\n\nPIETT\nAlert all commands.  Deploy the \nfleet.\n\nEXT. SPACE - IMPERIAL FLEET179 179\n\nVader\u0027s ship moves away, flanked by its fleet of smaller \nships.  the Avenger glides off into space in the opposite \ndirection.  No one on that ship or on Vader\u0027s is aware that, \nclinging to the side of the Avenger, is the pirateship, the \nMillennium Falcon.\n\nINT. MILLENNIUM FALCON - COCKPIT180 180\n\nTHREEPIO\nCaptain Solo, this time you have \ngone too far.\n\n(Chewie growls)\nNo, I will not be quiet, Chewbacca. \nWhy doesn\u0027t anyone listen to me?\n\nHAN\n(to Chewie)\n\nThe fleet is beginning to break up.  \nGo back and stand by the manual \nrelease for the landing claw.\n\nChewie barks, struggles from his seat, and climbs out of the \ncabin.\n\nTHREEPIO\nI really don\u0027t see how that is \ngoing to help.  Surrender is a \nperfectly acceptable alternative in \nextreme circumstances.  The Empire \nmay be gracious enough...\n\nLeia reaches over and shuts off Threepio, mid-sentence.\n\nHAN\nThank you.\n\nLEIA\nWhat did you have in mind for your \nnext move?\n\nHAN\nWell, if they follow standard \nImperial procedure, they\u0027ll dump \ntheir garbage before they go to \nlight-speed, then we just float \naway.\n\n81.\n\n\n\nLEIA\nWith the rest of the garbage. Then \nwhat?\n\nHAN\nThen we\u0027ve got to find a safe port \nsomewhere around here.  Got any \nideas?\n\nLEIA\nNo.  Where are we?\n\nHAN\nThe Anoat system.\n\nLEIA\nAnoat system.  There\u0027s not much \nthere.\n\nHAN\nNo.  Well, wait.  This is \ninteresting.  Lando.\n\nHe points to a computer mapscreen on the control panel.  \nLeia slips out of her chair and moves next to the handsome \npilot.  Small light points representing several systems \nflash by on the computer screen.\n\nLEIA\nLando system?\n\nHAN\nLando\u0027s not a system, he\u0027s a man. \nLando Calrissian.  He\u0027s a card \nplayer, gambler, scoundrel.  You\u0027d \nlike him.\n\nLEIA\nThanks.\n\nHAN\nBespin.  It\u0027s pretty far, but I \nthink we can make it.\n\nLEIA\n(reading from the \ncomputer)\n\nA mining colony?\n\nHAN\nYeah, a Tibanna gas mine.  Lando \nconned somebody out of it.  We go \nback a long way, Lando and me.\n\n82.\n\n\n\nLEIA\nCan you trust him?\n\nHAN\nNo.  But he has no love for the \nEmpire, I can tell you that.\n\nChewie barks over the intercom.  Han quickly changes his \nreadouts and stretches to look out the cockpit window.\n\nHAN (CONT’D)\n(into intercom)\n\nHere we go, Chewie.  Stand by. \nDetach!\n\nHan leans back in his chair and gives Leia an invisible \nsmile.  She thinks for a moment, shakes her head; a grin \ncreeps across her face and she gives him a quick kiss.\n\nLEIA\nYou do have your moments.  Not \nmany, but you have them.\n\nEXT. SPACE - IMPERIAL STAR DESTROYER181 181\n\nAs the Avenger Star Destroyer moves slowly into space, the \nhatch on its underbelly opens, sending a trail of junk \nbehind it.  Hidden among the refuse, the Falcon tumbles \naway.  In the next moment, the Avenger roars off into \nhyperspace.  The Falcon\u0027s engines are ignited, and it races \noff into the distance.  Amidst the slowly drifting junk, \nBoba Fett\u0027s ship appears and moves after the Falcon.\n\nEXT. DAGOBAH - BOG - CLEARING - DAY182 182\n\nIn the clearing behind Yoda\u0027s house, Luke again stands \nupside-down, but his face shows less strain and more \nconcentration than before.  Yoda sits on the ground below \nthe young warrior.  On the other side of the clearing, two \nequipment cases slowly rise into the air.  Nearby Artoo \nwatches, humming to himself, when suddenly he, too, rises \ninto the air. His little legs kick desperately and his head \nturns frantically, looking for help.\n\nYODA\nConcentrate... feel the Force flow.  \nYes.  Good.  Calm, yes. Through the \nForce, things you will see.  Other \nplaces.  The future... the past.  \nOld friends long gone.\n\nLuke suddenly becomes distressed.\n\n83.\n\n\n\nLUKE\nHan!  Leia!\n\nThe two packing boxes and Artoo fall to the ground with a \ncrash, then Luke himself tumbles over.\n\nYODA\n(shaking his head)\n\nHmm.  Control, control.  You must \nlearn control.\n\nLUKE\nI saw... I saw a city in the \nclouds.\n\nYODA\nMmm.  Friends you have there.\n\nLUKE\nThey were in pain.\n\nYODA\nIt is the future you see.\n\nLUKE\nFuture?  Will they die?\n\nYoda closes his eyes and lowers his head.\n\nYODA\nDifficult to see.  Always in motion \nis the future.\n\nLUKE\nI\u0027ve got to go to them.\n\nYODA\nDecide you must how to serve them \nbest.  If you leave now, help them \nyou could.  But you would destroy \nall for which they have fought and \nsuffered.\n\nLuke is stopped cold by Yoda\u0027s words.  Gloom shrouds him as \nhe nods his head sadly.\n\nEXT. BESPIN SYSTEM - MILLENNIUM FALCON - DAWN183 183\n\nThe powerful pirate starship blasts through space as it \nheads toward the soft pink planet of Bespin.\n\n84.\n\n\n\nEXT. BESPIN SURFACE - MILLENNIUM FALCON184 184\n\nIt is down on the gaseous planet.  Huge billowing clouds \nform a canyon as the ship banks around them, heading toward \nthe system\u0027s Cloud City.\n\nSuddenly, two twin-pod cloud cars appear and move toward the \nFalcon. The cloud cars draw up alongside the starship.\n\nINT. MILLENNIUM FALCON - COCKPIT185 185\n\nOne of the cloud cars opens fire on the Falcon, its flak \nrocking the ship.  Chewie barks his concern.\n\nHAN\n(into transmitter)\n\nNo, I don\u0027t have a landing permit.  \nI\u0027m trying to reach Lando \nCalrissian.\n\nMore flak bursts outside the cockpit window and rattles the \nship\u0027s interior.  Leia looks worried.\n\nHAN (CONT’D)\n(into transmitter)\n\nWhoa!  Wait a minute!  Let me \nexplain.\n\nINTERCOM VOICE\nYou will not deviate from your \npresent course.\n\nTHREEPIO\nRather touchy, aren\u0027t they?\n\nLEIA\nI thought you knew this person.\n\nChewie barks and growls at his boss.\n\nHAN\n(to Chewie)\n\nWell, that was a long time ago. I\u0027m \nsure he\u0027s forgotten about that.\n\nINTERCOM VOICE\nPermission granted to land on \nPlatform Three-two-seven.\n\nHAN\n(into transmitter)\n\nThank you.\n\n85.\n\n\n\nAngry, Han snaps off the intercom.  Chewie looks at him and \ngrunts. Han turns to the worried princess and her droid.\n\nHAN (CONT’D)\nThere\u0027s nothing to worry about. We \ngo way back, Lando and me.\n\nLeia doesn\u0027t look convinced.\n\nLEIA\nWho\u0027s worried?\n\nEXT. CLOUD CITY - MILLENNIUM FALCON - CLOUD CARS186 186\n\nThe clouds part to reveal a full view of the city as it bobs \nin and out of the cloud surface.  The cloud cars and the \nFalcon head for the gleaming white metropolis.\n\nEXT. CLOUD CITY - LANDING PLATFORM - MILLENNIUM FALCON187 187\n\nWith the cloud cars still guarding it, the Falcon lands on \none of the Cloud City\u0027s platforms.\n\nEXT. LANDING PLATFORM - DOOR OF MILLENNIUM FALCON188 188\n\nHan and Leia stand at the open door, armed.  Behind them, \nChewie, also armed, surveys the scene warily.\n\nTHREEPIO\nOh.  No one to meet us.\n\nLEIA\nI don\u0027t like this.\n\nHAN\nWell, what would you like?\n\nTHREEPIO\nWell, they did let us land.\n\nHAN\nLook, don\u0027t worry.  Everything\u0027s \ngoing to be fine.  Trust me.\n\nINT. CLOUD CITY - CORRIDOR - DAY189 189\n\nLando Calrissian, a suave, dashing black man in his \nthirties, leads a group of aides and some Cloud City guard \nrapidly toward the landing platform.\n\nThe group, like the other citizens of the city, is a motley \ncollection of aliens, droids, and humans of all \ndescriptions.  Lando has a grim expression on his face as he \nmoves onto the landing platform.\n\n86.\n\n\n\nEXT. LANDING PLATFORM - DOOR OF MILLENNIUM FALCON190 190\n\nHAN\nSee?  My friend.\n\n(to Chewie)\nKeep your eyes open, okay?\n\nChewie growls as Han walks down the ramp.  Lando and his men \nhead across the bridge to meet the space pirate.\n\nEXT. CLOUD CITY - LANDING PLATFORM191 191\n\nLando stops ten feet from Han.  The two men eye each other \ncarefully. Lando shakes his head.\n\nLANDO\nWhy, you slimy, double-crossing, no-\ngood swindler!  You\u0027ve got a lot of \nguts coming here, after what you \npulled.\n\nHan points to himself innocently, mouthing, \"Me?\"\n\nLando moves threateningly toward Han.  Suddenly, he throws \nhis arms around his startled, long-lost friend and embraces \nhim.\n\nLANDO (CONT’D)\n(laughs)\n\nHow you doing, you old pirate? So \ngood to see you!  I never thought \nI\u0027d catch up with you again.  Where \nyou been?\n\nThe two old friends embrace, laughing and chuckling.\n\nEXT. LANDING PLATFORM - DOOR OF MILLENNIUM FALCON.192 192\n\nTHREEPIO\nWell, he seems very friendly.\n\nLEIA\n(wary)\n\nYes... very friendly.\n\nEXT. CLOUD CITY - LANDING PLATFORM193 193\n\nLANDO\nWhat are you doing here?\n\nHAN\n(gestures toward the \nFalcon)\n\n(MORE)\n\n87.\n\n\n\nAhh... repairs.  I thought you \ncould help me out.\n\nLANDO\n(in mock panic)\n\nWhat have you done to my ship?\n\nHAN\nYour ship?  Hey, remember, you lost \nher to me fair and square.\n\nChewie growls a reserved greeting.  Lando suddenly notices \nthe princess and smiles.\n\nLANDO\nHello.  What have we here? Welcome.  \nI\u0027m Lando Calrissian. I\u0027m the \nadministrator of this facility.  \nAnd who might you be?\n\nLEIA\nLeia.\n\nLANDO\nWelcome, Leia.\n\nLando bows before Leia and kisses her hand.\n\nHAN\nAll right, all right, you old \nsmoothie.\n\nHan takes Leia by the hand and steers her away from Lando.\n\nTHREEPIO\nHello, sir.  I am See-Threepio, \nhuman-cyborg relations.  My \nfacilities are at your...\n\nBefore Threepio can finish his self-introduction, Lando has \nturned to follow Han and Leia, who are walking toward the \ncity.\n\nTHREEPIO (CONT’D)\nWell, really!\n\nLando, his aide, Lobot, and Han lead the way across the \nbridge, followed by Threepio, Chewie and Leia.\n\nLANDO\nWhat\u0027s wrong with the Falcon?\n\nHAN\nHyperdrive.\n\nHAN (CONT\u0027D)\n\n88.\n\n\n\nLANDO\nI\u0027ll get my people to work on it.\n\nHAN\nGood.\n\nLando turns to Leia.\n\nLANDO\nYou know, that ship saved my life \nquite a few times.  She\u0027s the \nfastest hunk of junk in the galaxy.\n\nINT. CLOUD CITY - CORRIDOR194 194\n\nThe group has crossed the narrow bridge and entered the \ncity.  They walk down the lovely Art Deco passageway, \nrounding several corners and passing many small plazas as \nthey go.  Threepio lags a bit behind.\n\nHAN\nHow\u0027s the gas mine?  Is it paying \noff for you?\n\nLANDO\nOh, not as well as I\u0027d like. We\u0027re \na small outpost and not very self-\nsufficient.  And I\u0027ve had supply \nproblems of every kind. I\u0027ve had \nlabor difficulties...\n\n(catches Han grinning at \nhim)\n\nWhat\u0027s so funny?\n\nHAN\nYou.  Listen to you - you sound \nlike a businessman, a responsible \nleader.  Who\u0027d have thought that, \nhuh?\n\nLando is reflective.  He looks at Han a moment.\n\nLANDO\nYou know, seeing you sure brings \nback a few things.\n\nHAN\nYeah.\n\nLANDO\n(shakes his head)\n\nYeah.  I\u0027m responsible these days. \nIt\u0027s the price you pay for being \nsuccessful.\n\n89.\n\n\n\nHan and Lando laugh together, and the group moves on through \nthe corridor.\n\nThe lagging Threepio passes a Threepio-type silver droid who \nis coming out of a door.\n\nTHREEPIO\nOh!  Nice to see a familiar face.\n\nSECOND THREEPIO\n(mumbles)\n\nE chu ta!\n\nTHREEPIO\nHow rude!\n\nThreepio stops, watching the silver droid move away.  Then \nhe hears the muffled beeping and whistling of an R2 unit \ncoming from within the room.\n\nINT. CLOUD CITY - ANTEROOM195 195\n\nCurious, Threepio enters the room.\n\nTHREEPIO\nThat sounds like an R2 unit in \nthere.  I wonder if...\n\nThreepio walks through the doorway to the main room.  He \nlooks in.\n\nTHREEPIO (CONT’D)\nHello?  How interesting.  Oh, my.\n\nMAN\u0027S VOICE\n(from within)\n\nWho are you?\n\nTHREEPIO\nOh, I\u0027m terribly sorry.  I... I \ndidn\u0027t mean to intrude.  No, no, \nplease don\u0027t get up.  No!\n\nA laser bolt to Threepio\u0027s chest sends him flying in twenty \ndirections. Smoldering mechanical arms and legs bounce off \nthe walls as the door whooshes closed behind him.\n\nINT. CLOUD CITY - CORRIDOR196 196\n\nLando, Han, and Leia continue down the corridor unaware of \nThreepio\u0027s dreadful accident.  Chewbacca glances around, \nsniffs the air, but shrugs his shoulders and follows the \ngroup.\n\n90.\n\n\n\nEXT. DAGOBAH - BOG - DUSK197 197\n\nIn the bright lights of the fighter, Luke loads a heavy case \ninto the belly of the ship.  Artoo sits on top of the X-\nwing, settling down into his cubbyhole.  Yoda stands nearby \non a log.\n\nYODA\nLuke!  You must complete the \ntraining.\n\nLUKE\nI can\u0027t keep the vision out of my \nhead.  They\u0027re my friends.  I\u0027ve \ngot to help them.\n\nYODA\nYou must not go!\n\nLUKE\nBut Han and Leia will die if I \ndon\u0027t.\n\nBEN\u0027S VOICE\nYou don\u0027t know that.\n\nLuke looks toward the voice in amazement.  Ben has \nmaterialized as a real, slightly shimmering image near Yoda.  \nThe power of his presence stops Luke.\n\nBEN\nEven Yoda cannot see their fate.\n\nLUKE\nBut I can help them!  I feel the \nForce!\n\nBEN\nBut you cannot control it.  This is \na dangerous time for you, when you \nwill be tempted by the dark side of \nthe Force.\n\nYODA\nYes, yes.  To Obi-Wan you listen. \nThe cave.  Remember your failure at \nthe cave!\n\nLUKE\nBut I\u0027ve learned so much since \nthen.  Master Yoda, I promise to \nreturn and finish what I\u0027ve begun. \nYou have my word.\n\n91.\n\n\n\nBEN\nIt is you and your abilities the \nEmperor wants.  that is why your \nfriends are made to suffer.\n\nLUKE\nAnd that is why I have to go.\n\nBEN\nLuke, I don\u0027t want to lose you to \nthe Emperor the way I lost Vader.\n\nLUKE\nYou won\u0027t.\n\nYODA\nStopped they must be.  On this all \ndepends.  Only a fully trained Jedi \nKnight with the Force as his ally \nwill conquer Vader and his Emperor.  \nIf you end your training now, if \nyou choose the quick and easy path, \nas Vader did, you will become an \nagent of evil.\n\nBEN\nPatience.\n\nLUKE\nAnd sacrifice Han and Leia?\n\nYODA\nIf you honor what they fight for \n... yes!\n\nLuke is in great anguish.  He struggles with the dilemma, a \nbattle raging in his mind.\n\nBEN\nIf you choose to face Vader, you \nwill do it alone.  I cannot \ninterfere.\n\nLUKE\nI understand.\n\n(he moves to his X-wing)\nArtoo, fire up the converters.\n\nArtoo whistles a happy reply.\n\nBEN\nLuke, don\u0027t give in to hate - that \nleads to the dark side.\n\n92.\n\n\n\nLuke nods and climbs into his ship.\n\nYODA\nStrong is Vader.  Mind what you \nhave learned.  Save you it can.\n\nLUKE\nI will.  And I\u0027ll return.  I \npromise.\n\nArtoo closes the cockpit.  Ben and Yoda stand watching as \nthe roar of the engines and the wind engulf them.\n\nYODA\n(sighs)\n\nTold you, I did.  Reckless is he.  \nNow matters are worse.\n\nBEN\nThat boy is our last hope.\n\nYODA\n(looks up)\n\nNo.  There is another.\n\nEXT. SPACE - PLANET DAGOBAH198 198\n\nLuke\u0027s tiny X-wing rockets away from the green planet of \nDagobah and off into space.\n\nINT. CLOUD CITY - LIVING QUARTERS - DAY199 199\n\nWithin the quarters assigned her on Cloud City, Leia paces \nin agitation.  She has changed from her cold-weather pants \nand jacket to a lovely dress.  Her hair is down, tied back \nwith ribbons.  She moves from a large, open window and turns \nto see Han entering through the doorway.\n\nHAN\nThe ship is almost finished. Two or \nThree more things and we\u0027re in \ngreat shape.\n\nLEIA\nThe sooner the better.  Something\u0027s \nwrong here.  No one has seen or \nknows anything about Threepio. He\u0027s \nbeen gone too long to have gotten \nlost.\n\nHan takes Leia by the shoulders and gently kisses her \nforehead.\n\n93.\n\n\n\nHAN\nRelax.  I\u0027ll talk to Lando and see \nwhat I can find out.\n\nLEIA\nI don\u0027t trust Lando.\n\nHAN\nWell, I don\u0027t trust him, either. \nBut he is my friend.  Besides, \nwe\u0027ll soon be gone.\n\nLEIA\nAnd then you\u0027re as good as gone, \naren\u0027t you?\n\nNot speaking, Han considers her words and gazes at her \ntroubled face.\n\nINT. CLOUD CITY - JUNK ROOM200 200\n\nThe room is piled high with broken and discarded machine \nparts.  Four Ugnaughts, small hoglike creatures, separate \nthe junk and throw some pieces onto a conveyer belt which \nmoves briskly toward a pit of molten metal.  Pieces of \nThreepio\u0027s golden body move down the belt.  Chewie enters \nthe room and spots an Ugnaught picking up and inspecting \nThreepio\u0027s head.  The Wookiee barks a command, startling the \nUgnaught, then reaches to grab the head.  But the Ugnaught \ntosses it away from him to another Ugnaught.  This game of \nkeep-away goes on until Threepio\u0027s head falls from their \ngrip and bounces with a clang onto the ground.\n\nINT. CLOUD CITY - LIVING QUARTERS - DAY201 201\n\nThe door zaps open.  Chewbacca walks in, carrying a packing \ncase of Threepio, arms and legs hanging over the edge.\n\nLEIA\nWhat happened?\n\nChewie sets the case on a table, grunting and groaning an \nexplanation.\n\nHAN\nWhere?  Found him in a junk pile?\n\nLEIA\nOh, what a mess.  Chewie, do you \nthink you can repair him?\n\nThe giant Wookiee studies the array of robot parts.  He \nlooks at the princess and shrugs sadly.\n\n94.\n\n\n\nHAN\nLando\u0027s got people who can fix him.\n\nLEIA\nNo, thanks.\n\nThere is a buzz and the door slides open, revealing Lando.\n\nLANDO\nI\u0027m sorry.  Am I interrupting \nanything?\n\nLEIA\nNot really.\n\nLANDO\nYou look absolutely beautiful. You \ntruly belong here with us among the \nclouds.\n\nLEIA\n(coolly)\n\nThank you.\n\nLANDO\nWill you join me for a little \nrefreshment?\n\nHan looks at Lando suspiciously, but Chewie barks at the \nmention of food and licks his lips.\n\nLANDO (CONT’D)\nEveryone\u0027s invited, of course.\n\nLeia takes Lando\u0027s proffered arm, and the group turns to go.  \nLando spots Threepio\u0027s remains.\n\nLANDO (CONT’D)\nHaving trouble with you droid?\n\nHan and Leia exchange a quick glance.\n\nHAN\nNo.  No problem.  Why?\n\nHan and Leia move arm-in-arm through the door, followed by \nLando and Chewie.  The door slides closed behind them.\n\nINT. CLOUD CITY - CORRIDOR - DAY202 202\n\nLeia walks between Han and Lando as Chewie follows a short \ndistance behind.  Long shafts of light pour across the \ncorridor between tall, pure-white columns.\n\n95.\n\n\n\nLANDO\nSo you see, since we\u0027re a small \noperation, we don\u0027t fall into \nthe... uh... jurisdiction of the \nEmpire.\n\nLEIA\nSo you\u0027re part of the mining guild \nthen?\n\nLANDO\nNo, not actually.  Our operation is \nsmall enough not to be noticed... \nwhich is advantageous for everybody \nsince our customers are anxious to \navoid attracting attention to \nthemselves.\n\nThe group walks into another corridor and heads for a huge \ndoorway at the far end.\n\nHAN\nAren\u0027t you afraid the Empire\u0027s \ngoing to find out about this little \noperation and shut you down?\n\nLANDO\nThat\u0027s always been a danger looming \nlike a shadow over everything we\u0027ve \nbuilt here.  But things have \ndeveloped that will insure \nsecurity. I\u0027ve just made a deal \nthat will keep the Empire out of \nhere forever.\n\nINT. CLOUD CITY - DINING ROOM203 203\n\nThe mighty doors to the dining room slide open and the group \nenters the dining room.  At the far end of a huge banquet \ntable sits Darth Vader. Standing at his side and slightly \nbehind him is Boba Fett, the bounty hunter.\n\nFaster than the wink of an eye, Han draws his blaster and \npops off a couple of shots directly at Vader.  The Dark Lord \nquickly raises his hand, deflecting the bolts into one of \nthe side walls, where they explode harmlessly.  Just as \nquickly, Han\u0027s weapon zips into Vader\u0027s hand.  The evil \npresence calmly places the gun on the table in front of him.\n\nVADER\nWe would be honored if you would \njoin us.\n\nHan gives Lando a mean look.\n\n96.\n\n\n\nLANDO\nI had no choice.  They arrived \nright before you did.  I\u0027m sorry.\n\nHAN\nI\u0027m sorry, too.\n\nEXT.  LUKE\u0027S X-WING - BESPIN SYSTEM204 204\n\nLuke\u0027s X-wing races through thick clouds toward Cloud City.\n\nINT.  LUKE\u0027S X-WING - COCKPIT205 205\n\nLuke is grim-faced as he pilots his course toward Bespin\u0027s \nshining city.  Artoo\u0027s beeps and whistles are transmitted \nonto the scope.\n\nLUKE\n(into comlink)\n\nNo, Threepio\u0027s with them.\n\nArtoo whistles another worried inquiry.\n\nLUKE\n(into comlink)\n\nJust hang on.  We\u0027re almost there.\n\nINT. CLOUD CITY - LARGE CELL206 206\n\nChewbacca is in a Cloud City prison cell.  The stark room is \nflooded with hot light.  To add to Chewie\u0027s misery, a high-\npitched whistle screeches loudly.  Chewie is going mad.  He \nhits the wall with giant fists as he paces back and forth \nacross the cell floor.  The upper lights go off abruptly.  \nThe prisoner rubs his eyes and moves to a wall, where he \nlistens for a moment.  Then, moaning to himself, he moves to \na platform where the disassembled pieces of Threepio lie.  \nHe picks up the golden droid\u0027s head and meditates on it for \na moment, barking a few philosophical remarks.  Chewie \nsticks the robot\u0027s head on its torso and starts adjusting \nwires and circuits.\n\nSuddenly, the lights in Threepio\u0027s eyes spark to life as \nChewie touches two connectors together.  Threepio \nimmediately begins to speak, but his voice is so slow and so \nlow as to be nearly unintelligible.\n\nTHREEPIO\nMmmm.  Oh, my.  Uh, I, uh - Take \nthis off!  I, uh, don\u0027t mean to \nintrude here.  I, don\u0027t, no, no, \nno... Please don\u0027t get up.  No!\n\n97.\n\n\n\nChewie looks at Threepio in bewilderment, then scratches his \nfurry head.  He gets an idea and adjusts some connections, \nwhereupon Threepio immediately begins speaking normally.\n\nTHREEPIO (CONT’D)\nStormtroopers?  Here?  We\u0027re in \ndanger.  I must tell the others. \nOh, no!  I\u0027ve been shot!\n\nINT. CLOUD CITY - PRISON ENTRY AREA207 207\n\nDarth Vader strides through the room as two stormtroopers \nprepare an elaborate torture mechanism.  Han is strapped to \na rack which tilts forward onto the torture device.  Vader \nactivates the mechanism, creating two bursts of sparks, one \nof which strikes Han\u0027s face.\n\nThe door opens, and Vader leaves the torture room just as \nHan screams a sharp, piercing cry of agony.  Darth Vader \nmoves to the holding chamber, where Lando and Boba Fett \nawait him.\n\nINT. CLOUD CITY - HOLDING CHAMBER208 208\n\nLANDO\nLord Vader.\n\nVADER\n(to Fett)\n\nYou may take Captain Solo to Jabba \nthe Hut after I have Skywalker.\n\nHan\u0027s screams filter through the torture room door.\n\nBOBA FETT\nHe\u0027s no good to me dead.\n\nVADER\nHe will not be permanently damaged.\n\nLANDO\nLord Vader, what about Leia and the \nWookiee?\n\nVADER\nThey must never again leave this \ncity.\n\nLANDO\nThat was never a condition of our \nagreement, nor was giving Han to \nthis bounty hunter!\n\n98.\n\n\n\nVADER\nPerhaps you think you\u0027re being \ntreated unfairly.\n\nLANDO\nNo.\n\nVADER\nGood.  It would be unfortunate if I \nhad to leave a garrison here.\n\nVader turns and sweeps into the elevator with Boba Fett.  \nLando walks swiftly down another corridor, muttering to \nhimself.\n\nLANDO\nThis deal\u0027s getting worse all the \ntime.\n\nINT. CLOUD CITY - LARGE CELL209 209\n\nChewie now has a little more of Threepio back together.  One \narm is connected, but the legs are yet to be attached.  \nThere is one small problem, however.  It seems the Wookiee \nhas managed to put the droid\u0027s head on backwards.\n\nTHREEPIO\nOh, yes, that\u0027s very good.  I like \nthat.  Oh!  Something\u0027s not right \nbecause now I can\u0027t see.  Wait. \nWait!  Oh, my!  what have you done? \nI\u0027m backwards, you stupid furball. \nOnly an overgrown mophead like you \nwould be stupid enough...\n\nThreepio is cut off in mid-sentence as Chewie angrily \ndeactivates a circuit and the droid shuts down.  The Wookiee \nsmells something and sits up.  The door to the chamber \nslides open and a ragged Han Solo is shoved into the room by \ntwo stormtroopers.  Barking his concern, the huge Wookiee \ngives Han a big hug.  Han is very pale, with dark circles \nunder his eyes.\n\nHAN\nI feel terrible.\n\nChewie helps Han to a platform and then turns as the door \nslides open revealing Leia.  She, too, looks a little worse \nfor wear.  The troopers push her into the cell, and the door \nslides closed.  She moves to Han, who is lying on the \nplatform, and kneels next to him, gently stroking his head.\n\nLEIA\nWhy are they doing this?\n\n99.\n\n\n\nHAN\nThey never even asked me any \nquestions.\n\nThe cell door slides open.  Lando and two of his guards \nenter.\n\nLEIA\nLando.\n\nHAN\nGet out of here, Lando!\n\nLANDO\nShut up and listen!  Vader has \nagreed to turn Leia and Chewie over \nto me.\n\nHAN\nOver to you?\n\nLANDO\nThey\u0027ll have to stay here, but at \nleast they\u0027ll be safe.\n\nLEIA\nWhat about Han?\n\nLANDO\nVader\u0027s giving him to the bounty \nhunter.\n\nLEIA\nVader wants us all dead.\n\nLANDO\nHe doesn\u0027t want you at all.  He\u0027s \nafter somebody called Skywalker.\n\nHAN\nLuke?\n\nLANDO\nLord Vader has set a trap for him.\n\nLeia\u0027s mind is racing.\n\nLEIA\nAnd we\u0027re the bait.\n\nLANDO\nWell, he\u0027s on his way.\n\nHan\u0027s rage peaks.\n\n100.\n\n\n\nHAN\nPerfect.  You fixed us all pretty \ngood, didn\u0027t you?\n\n(spits it out)\nMy friend!\n\nHan hauls off and punches Lando.  The two friends are \ninstantly engaged in a frantic close-quarters fight.  The \nguards hit Han with their rifle butts and he flies across \nthe room.  Chewie growls and starts for the guards.  They \npoint their laser weapons at the giant Wookiee, but Lando \nstops them.\n\nLANDO\nStop!  I\u0027ve done all I can.  I\u0027m \nsorry I couldn\u0027t do better, but I \nhave my own problems.\n\nHAN\nYeah, you\u0027re a real hero.\n\nLando and the guards leave.  Han wipes the blood from his \nchin as Leia and Chewie help him up.\n\nLEIA\n(dabs at his wound)\n\nYou certainly have a way with \npeople.\n\nINT. CLOUD CITY - CARBON-FREEZING CHAMBER210 210\n\nFour armor-suited stormtroopers stand at the ready in the \nlarge chamber, which is filled with pipes and chemical \ntanks.  In the middle of the room is a round pit housing a \nhydraulic platform.  Darth Vader and Lando stand near the \nplatform.\n\nVADER\nThis facility is crude, but it \nshould be adequate to freeze \nSkywalker for his journey to the \nEmperor.\n\nAn Imperial soldier appears.\n\nIMPERIAL SOLDIER\nLord Vader, ship approaching. X-\nwing class.\n\nVADER\nGood.  Monitor Skywalker and allow \nhim to land.\n\nThe soldier bows and leaves the chamber.\n\n101.\n\n\n\nLANDO\nLord Vader, we only use this \nfacility for carbon freezing.  If \nyou put him in there, it might kill \nhim.\n\nVADER\nI do not want the Emperor\u0027s prize \ndamaged.  We will test it... on \nCaptain Solo.\n\nLando\u0027s face registers dismay.\n\nEXT. SPACE - BESPIN SYSTEM -  LUKE\u0027S X-WING211 211\n\nLuke\u0027s X-wing moves through the clouds as it nears the city.\n\nINT.  LUKE\u0027S X-WING - COCKPIT212 212\n\nEncountering no city guards, Luke scans the display panel \nwith concern.\n\nINT. CLOUD CITY - CARBON-FREEZING CHAMBER213 213\n\nThere is a great activity on the carbon-freezing platform.  \nSix Ugnaughts frantically prepare the chamber for use.  A \nspecial coffinlike container is put in place.  With Boba \nFett in the lead, a squad of six stormtroopers brings in \nHan, Leia and Chewie.  Strapped to Chewie\u0027s back, with only \nhis head, torso, and one arm assembled, is Threepio.  \nThreepio\u0027s head faces the opposite direction from Chewie\u0027s \nand the droid is constantly twisting around in a vain effort \nto see what is happening.  His one attached arm is animate \nand expressive, intermittently pointing, gesturing, and \ncovering his eyes.  The remaining pieces of his body are \nrandomly bundled to the Wookiee\u0027s back so that his legs and \nother arm stick out at odd angles from the pack.\n\nTHREEPIO\nIf only you had attached my legs, I \nwouldn\u0027t be in this ridiculous \nposition.  Now, remember, \nChewbacca, you have a \nresponsibility to me, so don\u0027t do \nanything foolish.\n\nHAN\n(to Lando)\n\nWhat\u0027s going on... buddy?\n\nLANDO\nYou\u0027re being put into carbon \nfreeze.\n\n102.\n\n\n\nBoba Fett moves away from the group to Darth Vader.\n\nBOBA FETT\nWhat if he doesn\u0027t survive?  He\u0027s \nworth a lot to me.\n\nVADER\nThe Empire will compensate you if \nhe dies.  Put him in!\n\nRealizing what is about to happen, Chewie lets out a wild \nhowl and attacks the stormtroopers surrounding Han.  Within \nseconds, other Imperial reinforcements join the scuffle, \nclubbing the giant Wookiee with their laser weapons.\n\nFrom the instant of Chewie\u0027s first move, Threepio begins to \nscream in panic while he tries to protect himself with his \none arm.\n\nTHREEPIO\nOh, no!  No, no, no!  Stop, \nChewbacca, stop...!\n\nThe stormtroopers are about to bash Chewie in the face.\n\nHAN\nStop, Chewie, stop!  Do you hear \nme?  Stop!\n\nTHREEPIO\nYes, stop, please!  I\u0027m not ready \nto die.\n\nHan breaks away from his captors.  Vader nods to the guards \nto let him go and the pirate breaks up the fight.\n\nHAN\nChewie!  Chewie, this won\u0027t help \nme.  Hey!\n\nHan gives the Wookiee a stern look.\n\nHAN (CONT’D)\nSave your strength.  There\u0027ll be \nanother time.  The princess - you \nhave to take care of her.  You hear \nme?\n\nHan winks at the Wookiee, who wails a doleful farewell.\n\nIn a flash the guards have slipped binders on Chewbacca, who \nis too distraught to protest.  Han turns to Princess Leia.  \nThey look sorrowfully at one another, then Han moves toward \nher and gives her a final, passionate kiss.\n\n103.\n\n\n\nLEIA\nI love you!\n\nHAN\nI know.\n\nTears roll down Leia\u0027s face as she watches the dashing \npirate walk to the hydraulic platform.  Han looks one final \ntime at his friends - and then, suddenly, the platform \ndrops.  Chewie howls.  Leia turns away in agony.\n\nLando winces in sorrow; it makes a life-changing impression \non him.\n\nInstantly, fiery liquid begins to pour down in a shower of \nsparks and fluid as great as any steel furnace.  Holding \nLeia, Chewie half-turns away from the sight, giving Threepio \na view of the procedure.\n\nTHREEPIO\nWhat... what\u0027s going on?  Turn \nround, Chewbacca, I can\u0027t see. \nOh... they\u0027ve encased him in \ncarbonite.  He should be quite well-\nprotected - if he survives the \nfreezing process, that is.\n\nChewie is in no mood for technical discussion; he gives the \ndroid an angry glance and bark.\n\nA huge mechanical tong lifts the steaming metal-encased \nspace pirate out of the vat and stands him on the platform.  \nSome Ugnaughts rush over and push the block over onto the \nplatform.  They slide the coffinlike structure to the block \nand lift the metal block, placing it inside.  They then \nattach an electronic box onto the structure and step away.  \nLando kneels and adjusts some knobs, measuring the heat.  He \nshakes his head in relief.\n\nVADER\nWell, Calrissian, did he survive?\n\nLANDO\nYes, he\u0027s alive.  And in perfect \nhibernation.\n\nVader turns to Boba Fett.\n\nVADER\nHe\u0027s all yours bounty hunter. Reset \nthe chamber for Skywalker.\n\nIMPERIAL OFFICER\nSkywalker has just landed, my lord.\n\n104.\n\n\n\nVADER\nGood.  See to it that he finds his \nway here.  Calrissian, take the \nprincess and the Wookiee to my \nship.\n\nLANDO\nYou said they\u0027d be left in the city \nunder my supervision.\n\nVADER\nI am altering the deal.  Pray I \ndon\u0027t alter it any further.\n\nLando\u0027s hand instinctively goes to his throat as he turns to \nLeia, Chewie, and Threepio.\n\nINT. CLOUD CITY - CORRIDOR - DAY214 214\n\nAs Luke and Artoo move carefully down a deserted corridor, \nthey hear a group of people coming down a side hallway.  \nArtoo lets out an excited series of beeps and whistles.  \nLuke glares at the tiny droid, who stops in his tracks with \na feeble squeak.\n\nBoba Fett enters from a side hallway followed by two guards \npushing the floating, encased body of Han Solo.  Two \nstormtroopers, who follow, immediately spot Luke and open \nfire on him.  The youth draws his weapon and blasts the two \ntroopers before they can get off a second shot.  The two \nguards whisk Han into another hallway as Fett lowers his arm \nand fires a deadly laser at Luke, which explodes to one side \nand tears up a huge chunk of wall.\n\nLuke rushes to a side hallway, but by the time he reaches \nit, Fett, Han, and the guards are gone.  A think metal door \nblocks the passage. Luke turns to see Leia, Chewie, \nThreepio, and Lando being herded down a second hallway by \nseveral other stormtroopers.  Leia turns just in time to see \nLuke.\n\nLEIA\nLuke!  Luke, don\u0027t - it\u0027s a trap!  \nIt\u0027s a trap!\n\nBefore she can finish, she is pulled through a doorway and \ndisappears from sight.  Luke races after the group, leaving \nlittle Artoo trailing behind.\n\nINT. CLOUD CITY - ANTEROOM215 215\n\nLuke runs into an anteroom and stops to get his bearings.  \nLeia and the others are nowhere to be seen.  \n\n105.\n\n\n\nBehind Luke, Artoo scoots down the corridor toward the \nanteroom when suddenly a giant metal door comes slamming \ndown, cutting off Luke\u0027s exit.  Several more doors clang \nshut, echoing through the chamber.\n\nINT. CLOUD CITY - HALLWAY LEADING TO ANTEROOM216 216\n\nArtoo stands with his nose pressed against the giant metal \ndoor.  He whistles a long sigh of relief and, a little \ndazed, wanders off in the other direction.\n\nINT. CLOUD CITY - CARBON-FREEZING CHAMBER - ANTEROOM217 217\n\nLuke cautiously walks forward among hissing pipes and steam.  \nSeeing an opening above him, he stops to look up.  As he \ndoes, the platform he stands on begins to move.\n\nINT. CLOUD CITY - CARBON-FREEZING CHAMBER218 218\n\nLuke rises into the chamber, borne by the platform.  The \nroom is deathly quiet.  Very little steam escapes the pipes \nand no one else seems to be in the large room.  Warily, Luke \nwalks toward the stairway.\n\nSteam begins to build up in the chamber.  Looking up through \nthe steam, Luke sees a dark figure standing on a walkway \nabove him.  Luke holsters his gun and moves up the stairs to \nface Vader.  He feels confident, eager to engage his enemy.\n\nVADER\nThe Force is with you, young \nSkywalker.  But you are not a Jedi \nyet.\n\nLuke ignites his sword in answer.  In an instant, Vader\u0027s \nown sword is lit.  Luke lunges, but Vader repels the blow.  \nAgain Luke attacks, and the swords of the two combatants \nclash in battle.\n\nINT. CLOUD CITY - CORRIDOR219 219\n\nLeia, Lando, and Chewie, with Threepio on his back, march \nalong, guarded by six stormtroopers.  The group reaches an \nintersection where Lobot and a dozen of Lando\u0027s guards stand \nat attention.\n\nThe guards immediately aim their weapons at the startled \nstormtroopers. Taking the stormtroopers\u0027 weapons from them, \nLobot hands one to Leia and one to Lando.\n\nLANDO\nWell done.  Hold them in the \nsecurity tower - and keep it quiet.  \nMove.\n\n106.\n\n\n\nAs Lando\u0027s guards quickly march the stormtroopers away, \nLando begins to undo Chewie\u0027s binding.\n\nLEIA\nWhat do you think you\u0027re doing?\n\nLANDO\nWe\u0027re getting out of here.\n\nTHREEPIO\nI knew all along it had to be a \nmistake.\n\nChewie turns on Lando and starts to choke him.\n\nLEIA\nDo you think that after what you \ndid to Han we\u0027re going to trust \nyou?\n\nLando tries to free himself from Chewie.\n\nLANDO\n(choking)\n\nI had no choice...\n\nChewie barks ferociously.\n\nTHREEPIO\n(to Chewie)\n\nWhat are you doing?  Trust him, \ntrust him!\n\nLEIA\nOh, so we understand, don\u0027t we, \nChewie?  He had no choice.\n\nLANDO\nI\u0027m just trying to help...\n\nLEIA\nWe don\u0027t need any of your help.\n\nLANDO\n(choking)\n\nH-a-a-a...\n\nLEIA\nWhat?\n\nTHREEPIO\nIt sounds like Han.\n\n107.\n\n\n\nLANDO\nThere\u0027s still a chance to save \nHan... I mean, at the East \nPlatform...\n\nLEIA\nChewie.\n\nChewie finally releases Lando, who fights to get his breath \nback.\n\nTHREEPIO\n(to Lando)\n\nI\u0027m terribly sorry about all this. \nAfter all, he\u0027s only a Wookiee.\n\nEXT. CLOUD CITY - EAST LANDING PLATFORM - BOBA FETT\u0027S SHIP220 220\n\nThe two guards slide Han\u0027s encased body into an opening in \nthe side of the bounty hunter\u0027s ship.  Boba Fett climb \naboard on a ladder next to the cargo hold.\n\nBOBA FETT\nPut Captain Solo in the cargo hold.\n\nAnd with that, the door slams shut.\n\nINT. CLOUD CITY - CORRIDOR221 221\n\nLando, Leia, and Chewie run down a Cloud City corridor when \nsuddenly they spot Artoo who rushes toward them, beeping \nwildly.\n\nTHREEPIO\nArtoo!  Artoo!  Where have you \nbeen?\n\nChewie turns around to see the stubby droid, causing \nThreepio to be spun out of sight of his friend.\n\nTHREEPIO\nTurn around, you wooly...!\n\n(to Artoo)\nHurry, hurry!  We\u0027re trying to save \nHan from the bounty hunter!\n\nWhistling frantically to Threepio, Artoo scoots along with \nthe racing group.\n\nTHREEPIO\nWell, at least your still in one \npiece!  Look what happened to me!\n\n108.\n\n\n\nEXT. EAST LANDING PLATFORM - SIDE BAY222 222\n\nAn elevator door slides open and Lando, Leia, and Chewbacca \nrace for a large bay overlooking the East Landing Platform.\n\nJust as they arrive, Boba Fett\u0027s ship takes off against a \ncloudy sunset sky.\n\nIn wild anguish, Chewie howls and starts firing at the ship.\n\nTHREEPIO\nOh, no!  Chewie, they\u0027re behind \nyou!\n\nA laser bolt explodes near the princess.  Everyone turns to \nsee what Threepio has already spotted coming from the other \ndirection; a squad of stormtroopers running toward them.  \nArtoo peeks out from the elevator.\n\nLeia and Chewbacca start firing at the troopers as Lando \nmakes a break for the elevator.  Laser bolts continue to \nexplode around the princess and the Wookiee, but they refuse \nto budge.  Lando sticks his head out of the elevator and \nmotions for the pair to run, but they barely notice.  They \nseem possessed, transported, as all the frustration of \ncaptivity and anger of loss pour through their death-dealing \nweapons.\n\nBut after a few moments, they begin to move through the rain \nof laser fire toward the elevator.  Once they are inside, \nthe door slams shut and the stormtroopers race forward.\n\nINT. CLOUD CITY - CARBON-FREEZING CHAMBER223 223\n\nLuke and Vader are locked in combat on the platform \noverlooking the chamber.  Their swords clash, the platform \nsways.  Luke aggressively drives Vader back, forcing Vader \nto use defensive tactics.\n\nVADER\nYou have learned much, young one.\n\nLUKE\nYou\u0027ll find I\u0027m full of surprises.\n\nVader makes two quick moves, hooking Luke\u0027s sword out of his \nhand and sending it flying.  Another lightning move at \nLuke\u0027s feet forces the youth to jump back to protect \nhimself.  Losing his balance, Luke rolls down the stairs to \nthe circular carbon-freezing platform.  There he sprawls on \nthe floor, surprised and shaken.  Just in time he looks up \nto see Vader, like a giant black bird, flying right at him.  \nLuke rolls away as Vader lands.  Crouching, Luke keeps his \ngaze steadily on his enemy.\n\n109.\n\n\n\nVADER\nYour destiny lies with me, \nSkywalker.  Obi-Wan knew this to be \ntrue.\n\nLUKE\nNo!\n\nBehind Luke the hydraulic elevator cover has opened \nnoiselessly.  All the while, Luke slowly, cautiously moves \nback, away from the Dark Lord.\n\nSuddenly, Vader attacks so forcefully that Luke loses his \nbalance and falls back into the opening.  There is a rumble, \nand in an instant freezing steam rises to obscure Vader\u0027s \nvision.   Vader turns aside and deactivates his sword.\n\nVADER\nAll to easy.  Perhaps you are not \nas strong as the Emperor thought.\n\nThrough the steam behind Vader something blurs upward.  \nLiquid metal begins to pour into the pit.\n\nVader turns around - and then looks up.  He sees Luke, who \nhas leaped fifteen feet straight up and who now hangs from \nsome hoses on the carbonite outlet.\n\nVADER (CONT’D)\nImpressive... most impressive.\n\nLuke jumps down to the platform where he is separated from \nVader by the steaming carbonite pit.  He raises his hand.  \nHis sword, which had fallen on another part of the platform, \nswiftly jumps into his outstretched hand and is instantly \nignited.  Vader immediately lights his sword as well.\n\nVADER (CONT’D)\nObi-Wan has taught you well.  You \nhave controlled your fear... now \nrelease your anger.\n\nLuke is more cautious, controlling his anger.  He begins to \nretreat as Vader goads him on.  As Luke takes a defensive \nposition, he realizes he has been foolhardy.  A quick sword \nexchange and Luke forces Vader back. Another exchange and \nVader retreats.  Luke presses forward.\n\nVADER (CONT’D)\nOnly your hatred can destroy me.\n\nBreathing hard, Luke jumps in the air, turning a somersault \nover Vader. He lands on the floor and slashes at Vader as \nthe room continues to fill up with steam.\n\n110.\n\n\n\nVader retreats before Luke\u0027s skillful sword.  Vader blocks \nthe sword, but looses his balance and falls into the outer \nrim of pipes.  The energy Luke has used to stop Vader has \nbrought him to the point of collapse.  Luke moves to the \nedge and looks down, but sees no sign of Vader.  He then \ndeactivates his sword, hooks it on his belt, and lowers \nhimself into the pit.\n\nINT. CLOUD CITY - TUNNEL AND REACTOR CONTROL ROOM224 224\n\nMoving through a tunnellike entrance, Luke cautiously \napproaches the reactor room.  He ignites his sword and moves \ninto the room and toward a large window as Vader enters.\n\nLuke raises his sword and moves forward to attack.\n\nBehind Luke a large piece of machinery detaches itself from \nthe wall and comes smashing forward toward his back.  Luke \nturns and cuts it in half just as another machine comes \nhurtling at him.  Using the Force, Luke manages to deflect \nit and send it flying as if it had hit an invisible shield.\n\nA large pipe detaches and comes flying at Luke.  He deflects \nit. Sparking wires pull out of the wall and begin to whip at \nthe youth. Small tools and equipment come flying at him.  \nBombardment from all sides, Luke does his best to deflect \neverything, but soon he is bloodied and bruised.  Finally, \none machine glances off his and goes flying out the large \nwindow.  A fierce wind blows into the room, unmoving, stands \nthe dark, rocklike figure of Vader.\n\nA piece of machinery hits Luke and he is knocked out of the \nwindow.\n\nINT. GANTRY - OUTSIDE CONTROL ROOM - REACTOR SHAFT225 225\n\nLuke falls onto the gantry, rolls, and hangs over the edge, \nholding his deactivated sword in hand.  He puts the sword on \nhis belt and begins to scramble up.\n\nINT. CLOUD CITY - CORRIDOR LEADING TO LANDING PLATFORM226 226\n\nLeia, Lando, Chewie and the droids come round a corner and \nhead for the door to the landing platform.  They glimpse the \nMillennium Falcon for a moment before the door slams shut.  \nThe group ducks into an alcove as stormtroopers arrive at \nthe end of the corridor.  The troopers send a rain of laser \nbolts at the group.  Chewie returns their fire as Lando \npunches desperately at the door\u0027s control panel.\n\nLANDO\nThe security codes has been \nchanged!\n\n111.\n\n\n\nTHREEPIO\nArtoo, you can tell the computer to \noverride the security system.\n\nThreepio points to a computer socket on the control panel.  \nArtoo beeps and scoots toward it.  Lando meanwhile has \nconnected up to the panel\u0027s intercom.\n\nLANDO\nAttention!  This is Lando \nCalrissian.  The Empire has takes \ncontrol of the city.  I advise \neveryone to leave before more \nImperial troops arrive.\n\nArtoo takes off a computer cover and sticks his computer arm \ninto the socket.  Suddenly, a short beep turns into a wild \nscream.  Artoo\u0027s circuits light up, his head spins wildly, \nand smoke begins to seep out underneath him.  Quickly, \nChewie pulls him away.\n\nLANDO (CONT’D)\nThis way.\n\nLando, Leia, Artoo, and Chewie flee down the corridor.  As \nhe scoots along with them, Artoo sends some angry beeps \nThreepio\u0027s way.\n\nTHREEPIO\nDon\u0027t blame me.  I\u0027m an \ninterpreter. I\u0027m not supposed to \nknow a power socket from a computer \nterminal.\n\nINT. CLOUD CITY - CORRIDOR227 227\n\nIn a panic, Cloud City residents are trying to get out of \nthe city. Some carry boxes, others packages.  They run, then \nchange direction. Some are shooting at stormtroopers, others \nsimply try to hide.\n\nOther stormtroopers pursue Lando, Leia, and Chewie who are \nfiring back at them.  Artoo works on another door to the \nlanding platform while Threepio berates him for his seeming \nineptitude.\n\nTHREEPIO\nWhat are you talking about?  We\u0027re \nnot interested in the hyperdrive on \nthe Millennium Falcon.  It\u0027s fixed!  \nJust open the door, you stupid \nlump.\n\n112.\n\n\n\nChewie, Leia, and Lando retreat along the corridor.  A \ntriumphant beep from Artoo - and the door snaps open.\n\nTHREEPIO (CONT’D)\n(to Artoo)\n\nI never doubted you for a second. \nWonderful!\n\nArtoo lays a cloud fog, obscuring everything, as the group \ndashes outside.\n\nEXT. LANDING PLATFORM - CLOUD CITY - DUSK228 228\n\nThey race for the Millennium Falcon as a battalion of \nstormtroopers reaches the main door.  Lando and Leia hold \noff the troops as the droids get on board with Chewie.  As \nChewie bounds to the ship the Threepio on his back, Threepio \nhits his head on the top of the ramp.\n\nTHREEPIO\nOuch!  Oh!  Ah!  That hurt.  Bend \ndown, you thoughtless... Ow!\n\nChewie starts up the ship.  The giant engines begin to whine \nas Lando and Leia race up the ramp under a hail of laser \nfire.\n\nLANDO\nLeia!  Go!\n\nINT. MILLENNIUM FALCON - CORRIDOR229 229\n\nArtoo drags the partially assembled Threepio down the \ncorridor of the Falcon.\n\nTHREEPIO\nI thought that hairy beast would be \nthe end of me.  Of course, I\u0027ve \nlooked better.\n\nArtoo beeps understandingly.\n\nINT. MILLENNIUM FALCON - COCKPIT230 230\n\nChewie works the controls as Leia sits in Han\u0027s seat and \nLando watches over their shoulders.  As Chewie pulls back on \nthe throttle, the ship begins to move.\n\nEXT. CLOUD CITY - LANDING PLATFORM - DUSK231 231\n\nThe Millennium Falcon lifts gracefully into the twilight sky \nand roars away from the city.  Troops fire after it and TIE \nfighters take off in pursuit.\n\n113.\n\n\n\nINT. GANTRY - OUTSIDE CONTROL ROOM - REACTOR SHAFT232 232\n\nLuke moves along the railing and up to the control room.\n\nVader lunges at him and Luke immediately raises his lit \nsword to meet Vader\u0027s.  Sparks fly as they duel, Vader \ngradually forcing Luke backward toward the gantry.\n\nVADER\nYou are beaten.  It is useless to \nresist.  Don\u0027t let yourself be \ndestroyed as Obi-Wan did.\n\nLuke answers by rolling sideways and thrusting his sword at \nVader so viciously that he nicks Vader on the shoulder.  The \nblack armor sparks and smokes and Vader seems to be hurt, \nbut immediately recovers.\n\nLuke backs off along the narrow end of the gantry as Vader \ncomes at him, slashing at the young Jedi with his sword.  \nLuke makes a quick move around the instrument complex \nattached to the end of the gantry. Vader\u0027s sword comes \nslashing down, cutting the complex loose; it begins to fall, \nthen is caught by the rising wind and blown upward.\n\nLuke glances at the instrument complex floating away.  At \nthat instant, Vader\u0027s sword comes down across Luke\u0027s right \nforearm, cutting off his hand and sending his sword flying.  \nIn great pain, Luke squeezes his forearm under his left \narmpit and moves back along the gantry to its extreme end.  \nVader follows.  The wind subsides.  Luke holds on.  There is \nnowhere else to go.\n\nVADER (CONT’D)\nThere is no escape.  Don\u0027t make me \ndestroy you.  You do not yet \nrealize your importance.  You have \nonly begun to discover your power.  \nJoin me and I will complete your \ntraining.  With our combined \nstrength, we can end this \ndestructive conflict and bring \norder to the galaxy.\n\nLUKE\nI\u0027ll never join you!\n\nVADER\nIf you only knew the power of the \ndark side.  Obi-Wan never told you \nwhat happened to your father.\n\n114.\n\n\n\nLUKE\nHe told me enough!  It was you who \nkilled him.\n\nVADER\nNo.  I am your father.\n\nShocked, Luke looks at Vader in utter disbelief.\n\nLUKE\nNo.  No.  That\u0027s not true! That\u0027s \nimpossible!\n\nVADER\nSearch your feelings.  You know it \nto be true.\n\nLUKE\nNo!  No!  No!\n\nVADER\nLuke.  You can destroy the Emperor. \nHe has foreseen this.  It is your \ndestiny.  Join me, and together we \ncan rule the galaxy as father and \nson.  Come with me.  It is the only \nway.\n\nVader puts away his sword and holds his hand out to Luke.\n\nA calm comes over Luke, and he makes a decision.  In the \nnext instant he steps off the gantry platform into space.  \nThe Dark Lord looks over the platform and sees Luke falling \nfar below.  The wind begins to blow at Vader\u0027s cape and the \ntorrent finally forces him back, away from the edge.  The \nwind soon fades and the wounded Jedi begins to drop fast, \nunable to grab onto anything to break his fall.\n\nINT. REACTOR SHAFT233 233\n\nSuddenly Luke is sucked into an exhaust pipe in the side of \nthe shaft. When Vader sees this, he turns and hurries off \nthe platform.\n\nINT. EXHAUST PIPE234 234\n\nLuke tumbles through the exhaust pipe.\n\nHe slides to the end of the slickly polished pipe and stops \nas his feet hit a circular grill and knock it open.  Luke \nclaws at the surface of the pipe, trying to keep from \nsliding out into space.\n\n115.\n\n\n\nEXT. BOTTOM OF CLOUD CITY - WEATHER VANE - DUSK235 235\n\nUnable to hang onto the pipe, Luke tumbles out, emerging at \nthe undermost part of Cloud City.  Reaching out desperately, \nhe manages to grab onto on electronic weather vane.\n\nLUKE\nBen... Ben, please!\n\nLuke tries to pull himself up on the weather vane but slips \nback down. He hooks one of his legs around the fragile \ninstruments.  All the while, a powerful current of air \nrushes out at him from the exhaust pipe.\n\nLUKE (CONT’D)\nBen.  Leia!\n\nThere is an ominous cracking sound from the base of the \nweather vane and a piece breaks off, falling into the clouds \nfar below.\n\nLUKE (CONT’D)\nHear me!  Leia!\n\nINT. MILLENNIUM FALCON - COCKPIT236 236\n\nLeia seems to be lost in a fog, her expression troubled.  \nChewie is busy operating the ship.  Lando stands next to the \nWookiee, watching a readout on the control panel.\n\nLEIA\nLuke... We\u0027ve got to go back.\n\nChewie growls in surprise.\n\nLANDO\nWhat?\n\nLEIA\nI know where Luke is.\n\nLANDO\nBut what about those fighter?\n\nChewie barks in agreement with Lando.\n\nLEIA\nChewie, just do it.\n\nLANDO\nBut what about Vader?\n\nChewie turns on Lando, the newcomer, with an ominous growl.\n\n116.\n\n\n\nLANDO (CONT’D)\nAll right, all right, all right.\n\nEXT. CLOUD CITY - MILLENNIUM FALCON - DUSK237 237\n\nThe Falcon makes a graceful banking turn back toward Cloud \nCity.\n\nEXT. CLOUD CITY - LANDING PLATFORM238 238\n\nVader enters the landing platform and watches as the speck \nthat is the Falcon disappears.  The wind blows at his cape.\n\nHe turns to two aides who are standing near the entrance to \nthe landing platform.\n\nVADER\nBring my shuttle.\n\nEXT. BOTTOM OF CLOUD CITY - WEATHER VANE239 239\n\nNearly unconscious, Luke hangs upside-down on the weather \nvane as his body shifts in the wind.\n\nEXT. MILLENNIUM FALCON - BOTTOM OF CLOUD CITY240 240\n\nThe Falcon dives to the underside of the floating city.  \nThree TIE fighter close in on the starship.\n\nINT. MILLENNIUM FALCON241 241\n\nLeia tries to remain calm.\n\nLANDO\n(pointing out the cockpit \nwindow)\n\nLook, someone\u0027s up there.\n\nLEIA\nIt\u0027s Luke.  Chewie, slow down. Slow \ndown and we\u0027ll get under him. \nLando, open the top hatch.\n\nLando rushes out of the cockpit.\n\nEXT. BOTTOM OF CLOUD CITY - WEATHER VANE242 242\n\nLuke hangs by one arm from the crossbar of the weather vane.  \nHe slips from the bar and grabs onto the pole of the vane as \nthe Falcon banks toward him.  The Falcon positions itself \nunder Luke as Lando moves up through the opening of the \nhatch.  Luke begins to slide and finally falls from the vane \ninto space.\n\n117.\n\n\n\nINT. MILLENNIUM FALCON - COCKPIT243 243\n\nOut the cockpit window, Leia sees Luke falling from the \nbottom of the city.  The ship gains on him.\n\nLEIA\nOkay.  Easy, Chewie.\n\nThe Falcon closes in on Luke.\n\nEXT. BOTTOM OF CLOUD CITY244 244\n\nThree TIE fighters race toward the Falcon, firing away.\n\nINT. MILLENNIUM FALCON - HATCH245 245\n\nThe hatch pops open with a hiss of pressure.  Lando reaches \nout to help the battered warrior inside the ship.\n\nINT. MILLENNIUM FALCON - COCKPIT246 246\n\nFlak bursts all around it as the Falcon banks away from the \ncity.  Leia and Chewie struggle with the controls.\n\nLEIA\n(into intercom)\n\nLando?\n\nLANDO\n(over intercom)\n\nOkay, let\u0027s go.\n\nEXT. BOTTOM OF CLOUD CITY247 247\n\nThe Falcon races away.  It is closely followed by three TIE \nfighters, all of which keep up a heavy laser assault on the \nfleeing starship.\n\nINT. MILLENNIUM FALCON - COCKPIT248 248\n\nExplosions erupt all around the cockpit, buffeting the ship \nwildly. Chewie howls as he frantically tries to control the \nship.\n\nLeia and Chewie turns to see Luke, bloody and battered, \nenter the cockpit supported by Lando.  Leia jumps up and \nhugs him while Chewie barks in joyous relief.\n\nLUKE\nOh, Leia.\n\nLANDO\nAll right, Chewie.  Let\u0027s go.\n\n118.\n\n\n\nLeia helps Luke from the cockpit as another huge blast rocks \nthe ship.\n\nEXT. SPACE - CLOUD CITY - DAY249 249\n\nThe Falcon, still followed by the three TIE fighters, races \naway from the cloud-covered city.\n\nINT. MILLENNIUM FALCON - SLEEPING QUARTERS250 250\n\nLuke rests on a cot, his injured arm wrapped in a protective \ncuff. Leia gently wipes his face.  The ship lurches again.\n\nLEIA\nI\u0027ll be back.\n\nShe kisses him, then leaves the quarters.\n\nINT. MILLENNIUM FALCON - COCKPIT251 251\n\nAll over the ship muted alarm buzzers sound.  Lando \nanxiously watches the flashing lights on the control panel \nand hurriedly adjusts some switches.  Seated next to him, \nChewie points out a new blip appearing on the panel.  Leia, \nwatching over their shoulders, recognizes the shape.\n\nLEIA\nStar Destroyer.\n\nLANDO\nAll right, Chewie.  Ready for light-\nspeed.\n\nLEIA\nIf your people fixed the \nhyperdrive.\n\nAnother explosion rocks the ship.  Leia notices as a green \nlight on the panel next to her flashes on.\n\nLEIA (CONT’D)\nAll the coordinates are set. It\u0027s \nnow or never.\n\nChewie barks in agreement.\n\nLANDO\nPunch it!\n\nThe Wookiee shrugs and pulls back on the light-speed \nthrottle.  The sound of the ion engine changes...it is \nwinding up.  Faces are tense, expectant.  But nothing \nhappens, and the engine goes off.  Chewie lets out a \nfrustrated howl.  The flak still violently rocks the ship.\n\n119.\n\n\n\nLANDO (CONT’D)\nThey told me they fixed it.  I \ntrusted them to fix it.  It\u0027s not \nmy fault!\n\nChewie gets up from his chair and starts out of the cockpit.  \nHe gives Lando and angry shove as he storms past him.\n\nEXT. SPACE252 252\n\nIn the distance the TIE fighters continue their chase, still \nshooting lasers.  Vader\u0027s Star Destroyer moves behind them, \ndeterminedly following the Falcon.\n\nINT. VADER\u0027S STAR DESTROYER - BRIDGE253 253\n\nVader stands on the bridge looking out the window as Admiral \nPiett approaches him.\n\nPIETT\nThey\u0027ll be in range of our tractor \nbeam in moments, my lord.\n\nVADER\nDid your men deactivate the \nhyperdrive on the Millennium \nFalcon?\n\nPIETT\nYes, my lord.\n\nVADER\nGood.  Prepare the boarding party \nand set your weapons for stun.\n\nPIETT\nYes, my lord.\n\nINT. MILLENNIUM FALCON254 254\n\nBeeping while he works, Artoo is busy connecting some wires \nto Threepio who now has one leg attached.\n\nChewie enters through the doorway, grunting to himself.\n\nTHREEPIO\nNoisy brute.  Why don\u0027t we just go \ninto light-speed?\n\nArtoo beeps in response.\n\nTHREEPIO (CONT’D)\nWe can\u0027t?  How would you know the \nhyperdrive is deactivated?\n\n120.\n\n\n\nArtoo whistles knowingly.\n\nTHREEPIO (CONT’D)\nThe city\u0027s central computer told \nyou?  Artoo-Detoo, you know better \nthan to trust a strange computer. \nOuch!  Pay attention to what you\u0027re \ndoing!\n\nChewie is in the pit.  He is trying to loosen something with \nan enormous wrench.  Frustrated, he uses the wrench like a \nclub and hits the panel...\n\nINT. MILLENNIUM FALCON - COCKPIT255 255\n\nLeia and Lando, seated in front of the control panel, are \nsuddenly sprayed by a shower of sparks.\n\nINT. VADER\u0027S STAR DESTROYER - BRIDGE256 256\n\nVader stands on the bridge, watching as the Millennium \nFalcon is chased by the TIE fighters.  As his Destroyer \ndraws nearer, Vader\u0027s breathing gets slightly faster.\n\nVADER\nLuke.\n\nINT. MILLENNIUM FALCON - SLEEPING QUARTERS257 257\n\nLuke realizes that Vader\u0027s ship is very near.  He feels \nresigned to his fate.  He senses that he is beaten, more \nemotionally than physically.\n\nLUKE\nFather.\n\nINT. VADER\u0027S STAR DESTROYER - BRIDGE258 258\n\nVADER\nSon, come with me.\n\nINT. MILLENNIUM FALCON - SLEEPING QUARTERS259 259\n\nLUKE\n(moaning)\n\nBen, why didn\u0027t you tell me?\n\nINT. MILLENNIUM FALCON - COCKPIT260 260\n\nLando and Leia are at the controls of the Falcon.  \nMeanwhile, in the ship\u0027s hold, Chewie continues to work \nfrantically on the hyperdrive mechanism.\n\n121.\n\n\n\nLANDO\n(into intercom)\n\nChewie!\n\nEXT. SPACE261 261\n\nThe Falcon races through space followed very closely by the \nTIE fighters and the huge Imperial Star Destroyer.\n\nINT. MILLENNIUM FALCON - COCKPIT262 262\n\nLuke enters the cockpit and looks out the window.  He is \nalmost unconscious with pain and depression.\n\nLUKE\nIt\u0027s Vader.\n\nINT. VADER\u0027S STAR DESTROYER - BRIDGE263 263\n\nVADER\nLuke... it is your destiny.\n\nINT. MILLENNIUM FALCON - COCKPIT264 264\n\nLUKE\nBen, why didn\u0027t you tell me?\n\nINT. VADER\u0027S STAR DESTROYER - BRIDGE265 265\n\nPIETT\nAlert all commands.  Ready for the \ntractor beam.\n\nINT. MILLENNIUM FALCON - HOLD266 266\n\nArtoo races to a control panel and starts working on a \ncircuit board. Furious, Threepio stands on one leg, yelling.\n\nTHREEPIO\nArtoo, come back at once!  You \nhaven\u0027t finished with me yet! You \ndon\u0027t know how to fix the \nhyperdrive.  Chewbacca can do it.  \nI\u0027m standing here in pieces, and \nyou\u0027re having delusions of \ngrandeur!\n\nArtoo moves a circuit on a control panel.  Suddenly, the \ncontrol panel lights up.\n\nINT. MILLENNIUM FALCON - COCKPIT267 267\n\nLeia and Lando are thrown into their seats as the Millennium \nFalcon unexpectedly shoot into hyperspace.\n\n122.\n\n\n\nINT. MILLENNIUM FALCON - HOLD268 268\n\nThe ship tilts up and Artoo topples into the pit on top of \nChewie.\n\nTHREEPIO\nOh, you did it!\n\nEXT. SPACE269 269\n\nThe Falcon soars into infinity and away from the huge Star \nDestroyer which seems, by contrast, to stand still.\n\nINT. VADER\u0027S STAR DESTROYER - BRIDGE270 270\n\nAdmiral Piett and another captain glance at Vader in terror.  \nVader turns slowly and walks off the bridge, his hands held \nbehind his back in a contemplative gesture.\n\nEXT. SPACE - REBEL CRUISER271 271\n\nThe Millennium Falcon is attached to a huge Rebel cruiser by \na docking tube.  Rebel fighters move about the giant \ncruiser, and a Rebel transport ship hovers near the fleet.\n\nINT. MILLENNIUM FALCON - COCKPIT272 272\n\nLando sits in the pilot\u0027s seat as he talks into the comlink.  \nChewie busily throws a variety of switches in preparation \nfor takeoff.\n\nLANDO\n(into comlink)\n\nLuke, we\u0027re ready for takeoff.\n\nLUKE\n(over comlink)\n\nGood luck, Lando\n\nLANDO\n(into comlink)\n\nWhen we find Jabba the Hut and that \nbounty hunter, we\u0027ll contact you.\n\nINT. STAR CRUISER - MEDICAL CENTER273 273\n\nLuke speaking into the comlink as a medical droid works on \nhis hand. Leia stands near him while Threepio and Artoo look \nout the window.\n\nLUKE\n(into comlink)\n\nI\u0027ll meet you at the rendezvous \npoint on Tatooine.\n\n123.\n\n\n\nINT. MILLENNIUM FALCON - COCKPIT274 274\n\nLANDO\n(into comlink)\n\nPrincess, we\u0027ll find Han.  I \npromise.\n\nINT. STAR CRUISER - MEDICAL CENTER275 275\n\nLUKE\n(into comlink)\n\nChewie, I\u0027ll be waiting for your \nsignal.\n\nChewie\u0027s wail comes over the comlink.\n\nLUKE (CONT’D)\n(into comlink)\n\nTake care, you two.  May the Force \nbe with you.\n\nLuke looks down at his hand.  A metalized type of bandage \nhas been wrapped around his wrist.  The medical droid makes \nsome adjustments in a tiny electronic unit, then pricks each \none of Luke\u0027s fingers.\n\nLUKE (CONT’D)\nOw!\n\nLuke wriggles his fingers, makes a fist, and relaxes it.  \nHis hand is completely functional.\n\nHe gets up and walks over to Leia.  There is a new bond \nbetween them, a new understanding.  Leia is thinking about \nHan; Luke is thinking about his uncertain and newly \ncomplicated future.  Together they stand at the large window \nof the medical center looking out on the Rebel Star Cruiser \nand a dense, luminous galaxy swirling in space.\n\nLuke puts his arm around Leia.  The droids stand next to \nthem, and Threepio moves closer to Artoo putting his arm on \nhim.  The group watches as the Millennium Falcon moves into \nview, makes a turn, and zooms away into space.\n\nEXT. SPACE - REBEL STAR CRUISER276 276\n\nWhile Luke, Leia, and the droids stand, looking out the \nwindow of the star cruiser, two escort fighters join the \nlarge ship.  Slowly, the cruiser turns and moves away into \nspace.\n\nDISSOLVE TO\n\nEXT. GALAXY - SPACE277 277\n\n124.\n\n\n\nEND CREDITS FADE IN AND OUT OVER BACKGROUND278 278\n\nTHE END279 279\n\n125.\n\n\n",
    "X-TIKA:content_handler": "BodyContentHandler",
    "X-TIKA:digest:MD5": "7f3b0d0f2f7046f7c928deaad8b65310",
    "X-TIKA:digest:SHA256": "e3499df3aae5b86a8cbb4e70890068038767e245d103c9393c9b64c048c25040",
    "X-TIKA:embedded_depth": "0",
    "X-TIKA:parse_time_millis": "381",
    "access_permission:assemble_document": "true",
    "access_permission:can_modify": "true",
    "access_permission:can_print": "true",
    "access_permission:can_print_degraded": "true",
    "access_permission:extract_content": "true",
    "access_permission:extract_for_accessibility": "true",
    "access_permission:fill_in_form": "true",
    "access_permission:modify_annotations": "true",
    "date": "2018-01-11T00:41:23Z",
    "dc:format": "application/pdf; version\u003d1.3",
    "dc:title": "star-wars-episode-V-the-empire-strikes-back",
    "dcterms:created": "2018-01-11T00:18:54Z",
    "dcterms:modified": "2018-01-11T00:41:23Z",
    "meta:creation-date": "2018-01-11T00:18:54Z",
    "meta:keyword": "",
    "meta:save-date": "2018-01-11T00:41:23Z",
    "modified": "2018-01-11T00:41:23Z",
    "pdf:PDFVersion": "1.3",
    "pdf:charsPerPage": [
      "113",
      "1441",
      "1640",
      "1081",
      "1022",
      "695",
      "1082",
      "848",
      "870",
      "1803",
      "1462",
      "1174",
      "1199",
      "1052",
      "1324",
      "983",
      "1053",
      "1312",
      "1204",
      "911",
      "1398",
      "1196",
      "1310",
      "1137",
      "1247",
      "1479",
      "1301",
      "1273",
      "1502",
      "1390",
      "965",
      "1019",
      "1246",
      "1354",
      "946",
      "1462",
      "906",
      "1728",
      "1287",
      "1396",
      "1049",
      "1446",
      "1162",
      "1133",
      "1414",
      "1089",
      "971",
      "1771",
      "1371",
      "1136",
      "1340",
      "1606",
      "1604",
      "1100",
      "1222",
      "1141",
      "1157",
      "924",
      "1105",
      "1159",
      "854",
      "1172",
      "1290",
      "1054",
      "1710",
      "923",
      "1178",
      "1594",
      "911",
      "1408",
      "1112",
      "1492",
      "1138",
      "1695",
      "1269",
      "1566",
      "964",
      "1232",
      "1365",
      "1124",
      "1239",
      "1105",
      "803",
      "1602",
      "842",
      "1049",
      "1334",
      "1061",
      "955",
      "984",
      "1153",
      "993",
      "887",
      "1118",
      "1386",
      "967",
      "1410",
      "1531",
      "1214",
      "1500",
      "597",
      "1225",
      "1487",
      "1321",
      "1467",
      "1686",
      "1848",
      "677",
      "1094",
      "1960",
      "1691",
      "2173",
      "1467",
      "1406",
      "1703",
      "1297",
      "1120",
      "1314",
      "1169",
      "1326",
      "1086",
      "1226",
      "1125",
      "1249",
      "1425",
      "66"
    ],
    "pdf:docinfo:created": "2018-01-11T00:18:54Z",
    "pdf:docinfo:creator_tool": "Final Draft 10",
    "pdf:docinfo:keywords": "",
    "pdf:docinfo:modified": "2018-01-11T00:41:23Z",
    "pdf:docinfo:producer": "Mac OS X 10.13.2 Quartz PDFContext",
    "pdf:docinfo:title": "star-wars-episode-V-the-empire-strikes-back",
    "pdf:encrypted": "false",
    "pdf:hasXFA": "false",
    "pdf:hasXMP": "true",
    "pdf:unmappedUnicodeCharsPerPage": [
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0",
      "0"
    ],
    "title": "star-wars-episode-V-the-empire-strikes-back",
    "xmp:CreatorTool": "Final Draft 10",
    "xmpMM:DocumentID": "uuid:026c77a2-12c2-3843-9334-296bdce064c8",
    "xmpTPg:NPages": "126"
  }

#--Ingest Pipeline for Plugins --#
#Ingest Setup

#Verify the Plugin is working
GET _cat/plugins

#Define the ingest-pipeline for DOC PARSING
PUT /_ingest/pipeline/doc-parser
{
  "description" : "Extract text from base-64 encoded documents",
  "processors" : [ { "attachment" : { "field" : "encoded_doc" } } ]
}

PUT _ingest/pipeline/attachment
{
  "description" : "Extract attachment information",
  "processors" : [
    {
      "attachment" : {
        "field" : "data"
      }
    }
  ]
}

#Practice Queries Against Star Wars Episode V: Empire Strikes Back
GET /star_wars/_search
{
 "query": {
   "bool": {
     "must": [
       {
         "match": {
           "text_entry": "Han"
         }
       }
     ]
   }
 }
}
